HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
/*!< APB1DIV configuration */
#define CRM_CFG_APB1DIV_Pos                 (8U)
#define CRM_CFG_APB1DIV_Msk                 (0x7U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000700 */
#define CRM_CFG_APB1DIV                     CRM_CFG_APB1DIV_Msk                     /*!< APB1DIV[2:0] bits (APB1 division) */
#define CRM_CFG_APB1DIV_0                   (0x1U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000100 */
#define CRM_CFG_APB1DIV_1                   (0x2U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000200 */
#define CRM_CFG_APB1DIV_2                   (0x4U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000400 */

#define CRM_CFG_APB1DIV_DIV1                0x00000000U                             /*!< HCLK is not divided */
#define CRM_CFG_APB1DIV_DIV2                0x00000400U                             /*!< HCLK is divided by 2 */
#define CRM_CFG_APB1DIV_DIV4                0x00000500U                             /*!< HCLK is divided by 4 */
#define CRM_CFG_APB1DIV_DIV8                0x00000600U                             /*!< HCLK is divided by 8 */
#define CRM_CFG_APB1DIV_DIV16               0x00000700U                             /*!< HCLK is divided by 16 */

/*!< APB2DIV configuration */
#define CRM_CFG_APB2DIV_Pos                 (11U)
#define CRM_CFG_APB2DIV_Msk                 (0x7U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00003800 */
#define CRM_CFG_APB2DIV                     CRM_CFG_APB2DIV_Msk                     /*!< APB2DIV[2:0] bits (APB2 division) */
#define CRM_CFG_APB2DIV_0                   (0x1U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00000800 */
#define CRM_CFG_APB2DIV_1                   (0x2U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00001000 */
#define CRM_CFG_APB2DIV_2                   (0x4U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00002000 */

#define CRM_CFG_APB2DIV_DIV1                0x00000000U                             /*!< HCLK is not divided */
#define CRM_CFG_APB2DIV_DIV2                0x00002000U                             /*!< HCLK is divided by 2 */
#define CRM_CFG_APB2DIV_DIV4                0x00002800U                             /*!< HCLK is divided by 4 */
#define CRM_CFG_APB2DIV_DIV8                0x00003000U                             /*!< HCLK is divided by 8 */
#define CRM_CFG_APB2DIV_DIV16               0x00003800U                             /*!< HCLK is divided by 16 */

/*!< ADCDIV configuration */
#define CRM_CFG_ADCDIV_Pos                  (14U)
#define CRM_CFG_ADCDIV_Msk                  (0x3U << CRM_CFG_ADCDIV_Pos)            /*!< 0x0000C000 */
#define CRM_CFG_ADCDIV                      CRM_CFG_ADCDIV_Msk                      /*!< ADCDIV[1:0] bits (ADC division) */
#define CRM_CFG_ADCDIV_0                    (0x1U << CRM_CFG_ADCDIV_Pos)            /*!< 0x00004000 */
#define CRM_CFG_ADCDIV_1                    (0x2U << CRM_CFG_ADCDIV_Pos)            /*!< 0x00008000 */

#define CRM_CFG_ADCDIV_DIV2                 0x00000000U                             /*!< PCLK/2 */
#define CRM_CFG_ADCDIV_DIV4                 0x00004000U                             /*!< PCLK/4 */
#define CRM_CFG_ADCDIV_DIV6                 0x00008000U                             /*!< PCLK/6 */
#define CRM_CFG_ADCDIV_DIV8                 0x0000C000U                             /*!< PCLK/8 */

#define CRM_CFG_PLLRCS_Pos                  (16U)
#define CRM_CFG_PLLRCS_Msk                  (0x1U << CRM_CFG_PLLRCS_Pos)            /*!< 0x00010000 */
#define CRM_CFG_PLLRCS                      CRM_CFG_PLLRCS_Msk                      /*!< PLL entry clock select */

#define CRM_CFG_PLLHEXTDIV_Pos              (17U)
#define CRM_CFG_PLLHEXTDIV_Msk              (0x1U << CRM_CFG_PLLHEXTDIV_Pos)        /*!< 0x00020000 */
#define CRM_CFG_PLLHEXTDIV                  CRM_CFG_PLLHEXTDIV_Msk                  /*!< HEXT division selection for PLL entry clock */

#define CRM_CFG_PLLHEXTDIV_HEXT             0x00000000U                             /*!< HEXT is not divided */
#define CRM_CFG_PLLHEXTDIV_HEXT_DIV         0x00020000U                             /*!< HEXT is divided according to the setting of HEXTDIV */

/*!< PLLMULT configuration */
#define CRM_CFG_PLLMULT_Pos                 (18U)
#define CRM_CFG_PLLMULT_Msk                 (0xFU << CRM_CFG_PLLMULT_Pos)           /*!< 0x003C0000 */
#define CRM_CFG_PLLMULT                     CRM_CFG_PLLMULT_Msk                     /*!< PLLMULT[3:0] bits (PLL multiplication factor) */
#define CRM_CFG_PLLMULT_0                   (0x1U << CRM_CFG_PLLMULT_Pos)           /*!< 0x00040000 */
#define CRM_CFG_PLLMULT_1                   (0x2U << CRM_CFG_PLLMULT_Pos)           /*!< 0x00080000 */
#define CRM_CFG_PLLMULT_2                   (0x4U << CRM_CFG_PLLMULT_Pos)           /*!< 0x00100000 */
#define CRM_CFG_PLLMULT_3                   (0x8U << CRM_CFG_PLLMULT_Pos)           /*!< 0x00200000 */

#define CRM_CFG_PLLMULT_MULT2               0x00000000U                             /*!< PLL input clock * 2 */
#define CRM_CFG_PLLMULT_MULT3_Pos           (18U)
#define CRM_CFG_PLLMULT_MULT3_Msk           (0x1U << CRM_CFG_PLLMULT_MULT3_Pos)     /*!< 0x00040000 */
#define CRM_CFG_PLLMULT_MULT3               CRM_CFG_PLLMULT_MULT3_Msk               /*!< PLL input clock * 3 */
#define CRM_CFG_PLLMULT_MULT4_Pos           (19U)
#define CRM_CFG_PLLMULT_MULT4_Msk           (0x1U << CRM_CFG_PLLMULT_MULT4_Pos)     /*!< 0x00080000 */
#define CRM_CFG_PLLMULT_MULT4               CRM_CFG_PLLMULT_MULT4_Msk               /*!< PLL input clock * 4 */
#define CRM_CFG_PLLMULT_MULT5_Pos           (18U)
#define CRM_CFG_PLLMULT_MULT5_Msk           (0x3U << CRM_CFG_PLLMULT_MULT5_Pos)     /*!< 0x000C0000 */
#define CRM_CFG_PLLMULT_MULT5               CRM_CFG_PLLMULT_MULT5_Msk               /*!< PLL input clock * 5 */
#define CRM_CFG_PLLMULT_MULT6_Pos           (20U)
#define CRM_CFG_PLLMULT_MULT6_Msk           (0x1U << CRM_CFG_PLLMULT_MULT6_Pos)     /*!< 0x00100000 */
#define CRM_CFG_PLLMULT_MULT6               CRM_CFG_PLLMULT_MULT6_Msk               /*!< PLL input clock * 6 */
#define CRM_CFG_PLLMULT_MULT7_Pos           (18U)
#define CRM_CFG_PLLMULT_MULT7_Msk           (0x5U << CRM_CFG_PLLMULT_MULT7_Pos)     /*!< 0x00140000 */
#define CRM_CFG_PLLMULT_MULT7               CRM_CFG_PLLMULT_MULT7_Msk               /*!< PLL input clock * 7 */
#define CRM_CFG_PLLMULT_MULT8_Pos           (19U)
#define CRM_CFG_PLLMULT_MULT8_Msk           (0x3U << CRM_CFG_PLLMULT_MULT8_Pos)     /*!< 0x00180000 */
#define CRM_CFG_PLLMULT_MULT8               CRM_CFG_PLLMULT_MULT8_Msk               /*!< PLL input clock * 8 */
#define CRM_CFG_PLLMULT_MULT9_Pos           (18U)
#define CRM_CFG_PLLMULT_MULT9_Msk           (0x7U << CRM_CFG_PLLMULT_MULT9_Pos)     /*!< 0x001C0000 */
#define CRM_CFG_PLLMULT_MULT9               CRM_CFG_PLLMULT_MULT9_Msk               /*!< PLL input clock * 9 */
#define CRM_CFG_PLLMULT_MULT10_Pos          (21U)
#define CRM_CFG_PLLMULT_MULT10_Msk          (0x1U << CRM_CFG_PLLMULT_MULT10_Pos)    /*!< 0x00200000 */
#define CRM_CFG_PLLMULT_MULT10              CRM_CFG_PLLMULT_MULT10_Msk              /*!< PLL input clock * 10 */
#define CRM_CFG_PLLMULT_MULT11_Pos          (18U)
#define CRM_CFG_PLLMULT_MULT11_Msk          (0x9U << CRM_CFG_PLLMULT_MULT11_Pos)    /*!< 0x00240000 */
#define CRM_CFG_PLLMULT_MULT11              CRM_CFG_PLLMULT_MULT11_Msk              /*!< PLL input clock * 11 */
#define CRM_CFG_PLLMULT_MULT12_Pos          (19U)
#define CRM_CFG_PLLMULT_MULT12_Msk          (0x5U << CRM_CFG_PLLMULT_MULT12_Pos)    /*!< 0x00280000 */
#define CRM_CFG_PLLMULT_MULT12              CRM_CFG_PLLMULT_MULT12_Msk              /*!< PLL input clock * 12 */
#define CRM_CFG_PLLMULT_MULT13_Pos          (18U)
#define CRM_CFG_PLLMULT_MULT13_Msk          (0xBU << CRM_CFG_PLLMULT_MULT13_Pos)    /*!< 0x002C0000 */
#define CRM_CFG_PLLMULT_MULT13              CRM_CFG_PLLMULT_MULT13_Msk              /*!< PLL input clock * 13 */
#define CRM_CFG_PLLMULT_MULT14_Pos          (20U)
#define CRM_CFG_PLLMULT_MULT14_Msk          (0x3U << CRM_CFG_PLLMULT_MULT14_Pos)    /*!< 0x00300000 */
#define CRM_CFG_PLLMULT_MULT14              CRM_CFG_PLLMULT_MULT14_Msk              /*!< PLL input clock * 14 */
#define CRM_CFG_PLLMULT_MULT15_Pos          (18U)
#define CRM_CFG_PLLMULT_MULT15_Msk          (0xDU << CRM_CFG_PLLMULT_MULT15_Pos)    /*!< 0x00340000 */
#define CRM_CFG_PLLMULT_MULT15              CRM_CFG_PLLMULT_MULT15_Msk              /*!< PLL input clock * 15 */
#define CRM_CFG_PLLMULT_MULT16_Pos          (19U)
#define CRM_CFG_PLLMULT_MULT16_Msk          (0x7U << CRM_CFG_PLLMULT_MULT16_Pos)    /*!< 0x00380000 */
#define CRM_CFG_PLLMULT_MULT16              CRM_CFG_PLLMULT_MULT16_Msk              /*!< PLL input clock * 16 */

#define CRM_CFG_USBDIV_Pos                  (22U)
#define CRM_CFG_USBDIV_Msk                  (0x3U << CRM_CFG_USBDIV_Pos)            /*!< 0x00C00000 */
#define CRM_CFG_USBDIV                      CRM_CFG_USBDIV_Msk                      /*!< USBDIV[1:0] bits (USB division factor) */
#define CRM_CFG_USBDIV_0                    (0x1U << CRM_CFG_USBDIV_Pos)            /*!< 0x00400000 */
#define CRM_CFG_USBDIV_1                    (0x2U << CRM_CFG_USBDIV_Pos)            /*!< 0x00800000 */

/*!< CLKOUT_SEL configuration */
#define CRM_CFG_CLKOUT_SEL_Pos              (24U)
#define CRM_CFG_CLKOUT_SEL_Msk              (0x7U << CRM_CFG_CLKOUT_SEL_Pos)        /*!< 0x07000000 */
#define CRM_CFG_CLKOUT_SEL                  CRM_CFG_CLKOUT_SEL_Msk                  /*!< CLKOUT_SEL[2:0] bits (Clock output selection) */
#define CRM_CFG_CLKOUT_SEL_0                (0x1U << CRM_CFG_CLKOUT_SEL_Pos)        /*!< 0x01000000 */
#define CRM_CFG_CLKOUT_SEL_1                (0x2U << CRM_CFG_CLKOUT_SEL_Pos)        /*!< 0x02000000 */
#define CRM_CFG_CLKOUT_SEL_2                (0x4U << CRM_CFG_CLKOUT_SEL_Pos)        /*!< 0x04000000 */

#define CRM_CFG_CLKOUT_SEL_NOCLOCK          0x00000000U                             /*!< Not clock output */
#define CRM_CFG_CLKOUT_SEL_LICK             0x02000000U                             /*!< LICK */
#define CRM_CFG_CLKOUT_SEL_LEXT             0x03000000U                             /*!< LEXT */
#define CRM_CFG_CLKOUT_SEL_SCLK             0x04000000U                             /*!< SCLK */
#define CRM_CFG_CLKOUT_SEL_HICK             0x05000000U                             /*!< HICK */
#define CRM_CFG_CLKOUT_SEL_HEXT             0x06000000U                             /*!< HEXT */
#define CRM_CFG_CLKOUT_SEL_PLL_DIV2         0x07000000U                             /*!< PLL/2 */

/* Reference defines */
#define CRM_CFG_CLKSEL                      CRM_CFG_CLKOUT_SEL
#define CRM_CFG_CLKSEL_0                    CRM_CFG_CLKOUT_SEL_0
#define CRM_CFG_CLKSEL_1                    CRM_CFG_CLKOUT_SEL_1
#define CRM_CFG_CLKSEL_2                    CRM_CFG_CLKOUT_SEL_2
#define CRM_CFG_CLKSEL_NOCLOCK              CRM_CFG_CLKOUT_SEL_NOCLOCK
#define CRM_CFG_CLKSEL_LICK                 CRM_CFG_CLKOUT_SEL_LICK
#define CRM_CFG_CLKSEL_LEXT                 CRM_CFG_CLKOUT_SEL_LEXT
#define CRM_CFG_CLKSEL_SCLK                 CRM_CFG_CLKOUT_SEL_SCLK
#define CRM_CFG_CLKSEL_HICK                 CRM_CFG_CLKOUT_SEL_HICK
#define CRM_CFG_CLKSEL_HEXT                 CRM_CFG_CLKOUT_SEL_HEXT
#define CRM_CFG_CLKSEL_PLL_DIV2             CRM_CFG_CLKOUT_SEL_PLL_DIV2

