HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
#define IOMUX_REMAP5_I2C1_GMUX_Pos          (4U)
#define IOMUX_REMAP5_I2C1_GMUX_Msk          (0xFU << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x000000F0 */
#define IOMUX_REMAP5_I2C1_GMUX              IOMUX_REMAP5_I2C1_GMUX_Msk              /*!< I2C1_GMUX[3:0] bits (I2C1 IO general multiplexing) */
#define IOMUX_REMAP5_I2C1_GMUX_0            (0x1U << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x00000010 */
#define IOMUX_REMAP5_I2C1_GMUX_1            (0x2U << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x00000020 */
#define IOMUX_REMAP5_I2C1_GMUX_2            (0x4U << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x00000040 */
#define IOMUX_REMAP5_I2C1_GMUX_3            (0x8U << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x00000080 */

#define IOMUX_REMAP5_I2C3_GMUX_Pos          (12U)
#define IOMUX_REMAP5_I2C3_GMUX_Msk          (0xFU << IOMUX_REMAP5_I2C3_GMUX_Pos)    /*!< 0x0000F000 */
#define IOMUX_REMAP5_I2C3_GMUX              IOMUX_REMAP5_I2C3_GMUX_Msk              /*!< I2C3_GMUX[3:0] bits (I2C3 IO general multiplexing) */
#define IOMUX_REMAP5_I2C3_GMUX_0            (0x1U << IOMUX_REMAP5_I2C3_GMUX_Pos)    /*!< 0x00001000 */
#define IOMUX_REMAP5_I2C3_GMUX_1            (0x2U << IOMUX_REMAP5_I2C3_GMUX_Pos)    /*!< 0x00002000 */
#define IOMUX_REMAP5_I2C3_GMUX_2            (0x4U << IOMUX_REMAP5_I2C3_GMUX_Pos)    /*!< 0x00004000 */
#define IOMUX_REMAP5_I2C3_GMUX_3            (0x8U << IOMUX_REMAP5_I2C3_GMUX_Pos)    /*!< 0x00008000 */

/*!< SPI1_GMUX configuration */
#define IOMUX_REMAP5_SPI1_GMUX_Pos          (16U)
#define IOMUX_REMAP5_SPI1_GMUX_Msk          (0xFU << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x000F0000 */
#define IOMUX_REMAP5_SPI1_GMUX              IOMUX_REMAP5_SPI1_GMUX_Msk              /*!< SPI1_GMUX[3:0] bits (SPI1 IO general multiplexing) */
#define IOMUX_REMAP5_SPI1_GMUX_0            (0x1U << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x00010000 */
#define IOMUX_REMAP5_SPI1_GMUX_1            (0x2U << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x00020000 */
#define IOMUX_REMAP5_SPI1_GMUX_2            (0x4U << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x00040000 */
#define IOMUX_REMAP5_SPI1_GMUX_3            (0x8U << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x00080000 */

#define IOMUX_REMAP5_SPI1_GMUX_MUX1         0x00000000U                             /*!< CS/PA4, SCK/PA5, MISO/PA6, MOSI/PA7, MCK/PB0 */
#define IOMUX_REMAP5_SPI1_GMUX_MUX2_Pos     (16U)                                   /*!< 0x00010000 */
#define IOMUX_REMAP5_SPI1_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP5_SPI1_GMUX_MUX2_Pos)
#define IOMUX_REMAP5_SPI1_GMUX_MUX2         IOMUX_REMAP5_SPI1_GMUX_MUX2_Msk         /*!< CS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5, MCK/PB0 */
#define IOMUX_REMAP5_SPI1_GMUX_MUX3_Pos     (17U)                                   /*!< 0x00020000 */
#define IOMUX_REMAP5_SPI1_GMUX_MUX3_Msk     (0x1U << IOMUX_REMAP5_SPI1_GMUX_MUX3_Pos)
#define IOMUX_REMAP5_SPI1_GMUX_MUX3         IOMUX_REMAP5_SPI1_GMUX_MUX3_Msk         /*!< CS/PA4, SCK/PA5, MISO/PA6, MOSI/PA7, MCK/PB6 */
#define IOMUX_REMAP5_SPI1_GMUX_MUX4_Pos     (16U)                                   /*!< 0x00030000 */
#define IOMUX_REMAP5_SPI1_GMUX_MUX4_Msk     (0x3U << IOMUX_REMAP5_SPI1_GMUX_MUX4_Pos)
#define IOMUX_REMAP5_SPI1_GMUX_MUX4         IOMUX_REMAP5_SPI1_GMUX_MUX4_Msk         /*!< CS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5, MCK/PB6 */

/*!< SPI2_GMUX configuration */
#define IOMUX_REMAP5_SPI2_GMUX_Pos          (20U)
#define IOMUX_REMAP5_SPI2_GMUX_Msk          (0xFU << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00F00000 */
#define IOMUX_REMAP5_SPI2_GMUX              IOMUX_REMAP5_SPI2_GMUX_Msk              /*!< SPI2_GMUX[3:0] bits (SPI2 IO general multiplexing) */
#define IOMUX_REMAP5_SPI2_GMUX_0            (0x1U << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00100000 */
#define IOMUX_REMAP5_SPI2_GMUX_1            (0x2U << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00200000 */
#define IOMUX_REMAP5_SPI2_GMUX_2            (0x4U << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00400000 */
#define IOMUX_REMAP5_SPI2_GMUX_3            (0x8U << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00800000 */

#define IOMUX_REMAP5_SPI2_GMUX_MUX1         0x00000000U                             /*!< MCK/PC6 */
#define IOMUX_REMAP5_SPI2_GMUX_MUX2_Pos     (20U)                                   /*!< 0x00100000 */
#define IOMUX_REMAP5_SPI2_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP5_SPI2_GMUX_MUX2_Pos)
#define IOMUX_REMAP5_SPI2_GMUX_MUX2         IOMUX_REMAP5_SPI2_GMUX_MUX2_Msk         /*!< MCK/PA3 */
#define IOMUX_REMAP5_SPI2_GMUX_MUX3_Pos     (21U)                                   /*!< 0x00200000 */
#define IOMUX_REMAP5_SPI2_GMUX_MUX3_Msk     (0x1U << IOMUX_REMAP5_SPI2_GMUX_MUX3_Pos)
#define IOMUX_REMAP5_SPI2_GMUX_MUX3         IOMUX_REMAP5_SPI2_GMUX_MUX3_Msk         /*!< MCK/PA6 */

/*!< SPI3_GMUX configuration */
#define IOMUX_REMAP5_SPI3_GMUX_Pos          (24U)
#define IOMUX_REMAP5_SPI3_GMUX_Msk          (0xFU << IOMUX_REMAP5_SPI3_GMUX_Pos)    /*!< 0x0F000000 */
#define IOMUX_REMAP5_SPI3_GMUX              IOMUX_REMAP5_SPI3_GMUX_Msk              /*!< SPI3_GMUX[3:0] bits (SPI3 IO general multiplexing) */
#define IOMUX_REMAP5_SPI3_GMUX_0            (0x1U << IOMUX_REMAP5_SPI3_GMUX_Pos)    /*!< 0x01000000 */
#define IOMUX_REMAP5_SPI3_GMUX_1            (0x2U << IOMUX_REMAP5_SPI3_GMUX_Pos)    /*!< 0x02000000 */
#define IOMUX_REMAP5_SPI3_GMUX_2            (0x4U << IOMUX_REMAP5_SPI3_GMUX_Pos)    /*!< 0x04000000 */
#define IOMUX_REMAP5_SPI3_GMUX_3            (0x8U << IOMUX_REMAP5_SPI3_GMUX_Pos)    /*!< 0x08000000 */

#define IOMUX_REMAP5_SPI3_GMUX_MUX1         0x00000000U                             /*!< CS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5, MCK/PC7 */
#define IOMUX_REMAP5_SPI3_GMUX_MUX2_Pos     (24U)                                   /*!< 0x01000000 */
#define IOMUX_REMAP5_SPI3_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP5_SPI3_GMUX_MUX2_Pos)
#define IOMUX_REMAP5_SPI3_GMUX_MUX2         IOMUX_REMAP5_SPI3_GMUX_MUX2_Msk         /*!< CS/PA4, SCK/PC10, MISO/PC11, MOSI/PC12, MCK/PC7 */
#define IOMUX_REMAP5_SPI3_GMUX_MUX3_Pos     (25U)                                   /*!< 0x02000000 */
#define IOMUX_REMAP5_SPI3_GMUX_MUX3_Msk     (0x1U << IOMUX_REMAP5_SPI3_GMUX_MUX3_Pos)
#define IOMUX_REMAP5_SPI3_GMUX_MUX3         IOMUX_REMAP5_SPI3_GMUX_MUX3_Msk         /*!< CS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5, MCK/PB10 */
#define IOMUX_REMAP5_SPI3_GMUX_MUX4_Pos     (24U)                                   /*!< 0x03000000 */
#define IOMUX_REMAP5_SPI3_GMUX_MUX4_Msk     (0x3U << IOMUX_REMAP5_SPI3_GMUX_MUX4_Pos)
#define IOMUX_REMAP5_SPI3_GMUX_MUX4         IOMUX_REMAP5_SPI3_GMUX_MUX4_Msk         /*!< CS/PA4, SCK/PC10, MISO/PC11, MOSI/PC12, MCK/PB10 */

/*!< SPI4_GMUX configuration */
#define IOMUX_REMAP5_SPI4_GMUX_Pos          (28U)
#define IOMUX_REMAP5_SPI4_GMUX_Msk          (0xFU << IOMUX_REMAP5_SPI4_GMUX_Pos)    /*!< 0xF0000000 */
#define IOMUX_REMAP5_SPI4_GMUX              IOMUX_REMAP5_SPI4_GMUX_Msk              /*!< SPI4_GMUX[3:0] bits (SPI4 IO general multiplexing) */
#define IOMUX_REMAP5_SPI4_GMUX_0            (0x1U << IOMUX_REMAP5_SPI4_GMUX_Pos)    /*!< 0x10000000 */
#define IOMUX_REMAP5_SPI4_GMUX_1            (0x2U << IOMUX_REMAP5_SPI4_GMUX_Pos)    /*!< 0x20000000 */
#define IOMUX_REMAP5_SPI4_GMUX_2            (0x4U << IOMUX_REMAP5_SPI4_GMUX_Pos)    /*!< 0x40000000 */
#define IOMUX_REMAP5_SPI4_GMUX_3            (0x8U << IOMUX_REMAP5_SPI4_GMUX_Pos)    /*!< 0x80000000 */

#define IOMUX_REMAP5_SPI4_GMUX_MUX1         0x00000000U                             /*!< CS/PE4, SCK/PE2, MISO/PE5, MOSI/PE6, MCK/PC8 */
#define IOMUX_REMAP5_SPI4_GMUX_MUX2_Pos     (28U)                                   /*!< 0x10000000 */
#define IOMUX_REMAP5_SPI4_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP5_SPI4_GMUX_MUX2_Pos)
#define IOMUX_REMAP5_SPI4_GMUX_MUX2         IOMUX_REMAP5_SPI4_GMUX_MUX2_Msk         /*!< CS/PE12, SCK/PE11, MISO/PE13, MOSI/PE14, MCK/PC8 */
#define IOMUX_REMAP5_SPI4_GMUX_MUX3_Pos     (29U)                                   /*!< 0x20000000 */
#define IOMUX_REMAP5_SPI4_GMUX_MUX3_Msk     (0x1U << IOMUX_REMAP5_SPI4_GMUX_MUX3_Pos)
#define IOMUX_REMAP5_SPI4_GMUX_MUX3         IOMUX_REMAP5_SPI4_GMUX_MUX3_Msk         /*!< CS/PB6, SCK/PB7, MISO/PB8, MOSI/PB9, MCK/PC8 */
#define IOMUX_REMAP5_SPI4_GMUX_MUX4_Pos     (28U)                                   /*!< 0x30000000 */
#define IOMUX_REMAP5_SPI4_GMUX_MUX4_Msk     (0x3U << IOMUX_REMAP5_SPI4_GMUX_MUX4_Pos)
#define IOMUX_REMAP5_SPI4_GMUX_MUX4         IOMUX_REMAP5_SPI4_GMUX_MUX4_Msk         /*!< CS/PB6, SCK/PB7, MISO/PB8, MOSI/PB9, MCK/PA10 */

/*****************  Bit definition for IOMUX_REMAP6 register  *****************/
/*!< CAN1_GMUX configuration */
#define IOMUX_REMAP6_CAN1_GMUX_Pos          (0U)
#define IOMUX_REMAP6_CAN1_GMUX_Msk          (0xFU << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x0000000F */
#define IOMUX_REMAP6_CAN1_GMUX              IOMUX_REMAP6_CAN1_GMUX_Msk              /*!< CAN1_GMUX[3:0] bits (CAN1 IO general multiplexing) */
#define IOMUX_REMAP6_CAN1_GMUX_0            (0x1U << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x00000001 */
#define IOMUX_REMAP6_CAN1_GMUX_1            (0x2U << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x00000002 */
#define IOMUX_REMAP6_CAN1_GMUX_2            (0x4U << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x00000004 */
#define IOMUX_REMAP6_CAN1_GMUX_3            (0x8U << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x00000008 */

#define IOMUX_REMAP6_CAN1_GMUX_MUX1         0x00000000U                             /*!< RX/PA11, TX/PA12 */
#define IOMUX_REMAP6_CAN1_GMUX_MUX2_Pos     (1U)                                    /*!< 0x00000002 */
#define IOMUX_REMAP6_CAN1_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP6_CAN1_GMUX_MUX2_Pos)
#define IOMUX_REMAP6_CAN1_GMUX_MUX2         IOMUX_REMAP6_CAN1_GMUX_MUX2_Msk         /*!< RX/PB8, TX/PB9 */
#define IOMUX_REMAP6_CAN1_GMUX_MUX3_Pos     (0U)                                    /*!< 0x00000003 */
#define IOMUX_REMAP6_CAN1_GMUX_MUX3_Msk     (0x3U << IOMUX_REMAP6_CAN1_GMUX_MUX3_Pos)
#define IOMUX_REMAP6_CAN1_GMUX_MUX3         IOMUX_REMAP6_CAN1_GMUX_MUX3_Msk         /*!< RX/PD0, TX/PD1 */

