HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
#define TMR_CM1_C2IDIV_Pos                  (10U)
#define TMR_CM1_C2IDIV_Msk                  (0x3U << TMR_CM1_C2IDIV_Pos)            /*!< 0x00000C00 */
#define TMR_CM1_C2IDIV                      TMR_CM1_C2IDIV_Msk                      /*!< C2IDIV[1:0] bits (Channel 2 input divider) */
#define TMR_CM1_C2IDIV_0                    (0x1U << TMR_CM1_C2IDIV_Pos)            /*!< 0x00000400 */
#define TMR_CM1_C2IDIV_1                    (0x2U << TMR_CM1_C2IDIV_Pos)            /*!< 0x00000800 */

#define TMR_CM1_C2DF_Pos                    (12U)
#define TMR_CM1_C2DF_Msk                    (0xFU << TMR_CM1_C2DF_Pos)              /*!< 0x0000F000 */
#define TMR_CM1_C2DF                        TMR_CM1_C2DF_Msk                        /*!< C2DF[3:0] bits (Channel 2 digital filter) */
#define TMR_CM1_C2DF_0                      (0x1U << TMR_CM1_C2DF_Pos)              /*!< 0x00001000 */
#define TMR_CM1_C2DF_1                      (0x2U << TMR_CM1_C2DF_Pos)              /*!< 0x00002000 */
#define TMR_CM1_C2DF_2                      (0x4U << TMR_CM1_C2DF_Pos)              /*!< 0x00004000 */
#define TMR_CM1_C2DF_3                      (0x8U << TMR_CM1_C2DF_Pos)              /*!< 0x00008000 */

/*******************  Bit definition for TMR_CM2 register  ********************/
#define TMR_CM2_C3C_Pos                     (0U)
#define TMR_CM2_C3C_Msk                     (0x3U << TMR_CM2_C3C_Pos)               /*!< 0x00000003 */
#define TMR_CM2_C3C                         TMR_CM2_C3C_Msk                         /*!< C3C[1:0] bits (Channel 3 configuration) */
#define TMR_CM2_C3C_0                       (0x1U << TMR_CM2_C3C_Pos)               /*!< 0x00000001 */
#define TMR_CM2_C3C_1                       (0x2U << TMR_CM2_C3C_Pos)               /*!< 0x00000002 */

#define TMR_CM2_C3OIEN_Pos                  (2U)
#define TMR_CM2_C3OIEN_Msk                  (0x1U << TMR_CM2_C3OIEN_Pos)            /*!< 0x00000004 */
#define TMR_CM2_C3OIEN                      TMR_CM2_C3OIEN_Msk                      /*!< Channel 3 output enable immediately */
#define TMR_CM2_C3OBEN_Pos                  (3U)
#define TMR_CM2_C3OBEN_Msk                  (0x1U << TMR_CM2_C3OBEN_Pos)            /*!< 0x00000008 */
#define TMR_CM2_C3OBEN                      TMR_CM2_C3OBEN_Msk                      /*!< Channel 3 output buffer enable */

#define TMR_CM2_C3OCTRL_Pos                 (4U)
#define TMR_CM2_C3OCTRL_Msk                 (0x7U << TMR_CM2_C3OCTRL_Pos)           /*!< 0x00000070 */
#define TMR_CM2_C3OCTRL                     TMR_CM2_C3OCTRL_Msk                     /*!< C3OCTRL[2:0] bits (Channel 3 output control) */
#define TMR_CM2_C3OCTRL_0                   (0x1U << TMR_CM2_C3OCTRL_Pos)           /*!< 0x00000010 */
#define TMR_CM2_C3OCTRL_1                   (0x2U << TMR_CM2_C3OCTRL_Pos)           /*!< 0x00000020 */
#define TMR_CM2_C3OCTRL_2                   (0x4U << TMR_CM2_C3OCTRL_Pos)           /*!< 0x00000040 */

#define TMR_CM2_C3OSEN_Pos                  (7U)
#define TMR_CM2_C3OSEN_Msk                  (0x1U << TMR_CM2_C3OSEN_Pos)            /*!< 0x00000080 */
#define TMR_CM2_C3OSEN                      TMR_CM2_C3OSEN_Msk                      /*!< Channel 3 output switch enable */

#define TMR_CM2_C4C_Pos                     (8U)
#define TMR_CM2_C4C_Msk                     (0x3U << TMR_CM2_C4C_Pos)               /*!< 0x00000300 */
#define TMR_CM2_C4C                         TMR_CM2_C4C_Msk                         /*!< C4C[1:0] bits (Channel 4 configuration) */
#define TMR_CM2_C4C_0                       (0x1U << TMR_CM2_C4C_Pos)               /*!< 0x00000100 */
#define TMR_CM2_C4C_1                       (0x2U << TMR_CM2_C4C_Pos)               /*!< 0x00000200 */

#define TMR_CM2_C4OIEN_Pos                  (10U)
#define TMR_CM2_C4OIEN_Msk                  (0x1U << TMR_CM2_C4OIEN_Pos)            /*!< 0x00000400 */
#define TMR_CM2_C4OIEN                      TMR_CM2_C4OIEN_Msk                      /*!< Channel 4 output enable immediately */
#define TMR_CM2_C4OBEN_Pos                  (11U)
#define TMR_CM2_C4OBEN_Msk                  (0x1U << TMR_CM2_C4OBEN_Pos)            /*!< 0x00000800 */
#define TMR_CM2_C4OBEN                      TMR_CM2_C4OBEN_Msk                      /*!< Channel 4 output buffer enable */

#define TMR_CM2_C4OCTRL_Pos                 (12U)
#define TMR_CM2_C4OCTRL_Msk                 (0x7U << TMR_CM2_C4OCTRL_Pos)           /*!< 0x00007000 */
#define TMR_CM2_C4OCTRL                     TMR_CM2_C4OCTRL_Msk                     /*!< C4OCTRL[2:0] bits (Channel 4 output control) */
#define TMR_CM2_C4OCTRL_0                   (0x1U << TMR_CM2_C4OCTRL_Pos)           /*!< 0x00001000 */
#define TMR_CM2_C4OCTRL_1                   (0x2U << TMR_CM2_C4OCTRL_Pos)           /*!< 0x00002000 */
#define TMR_CM2_C4OCTRL_2                   (0x4U << TMR_CM2_C4OCTRL_Pos)           /*!< 0x00004000 */

#define TMR_CM2_C4OSEN_Pos                  (15U)
#define TMR_CM2_C4OSEN_Msk                  (0x1U << TMR_CM2_C4OSEN_Pos)            /*!< 0x00008000 */
#define TMR_CM2_C4OSEN                      TMR_CM2_C4OSEN_Msk                      /*!< Channel 4 output switch enable */

/*----------------------------------------------------------------------------*/

#define TMR_CM2_C3IDIV_Pos                  (2U)
#define TMR_CM2_C3IDIV_Msk                  (0x3U << TMR_CM2_C3IDIV_Pos)            /*!< 0x0000000C */
#define TMR_CM2_C3IDIV                      TMR_CM2_C3IDIV_Msk                      /*!< C3IDIV[1:0] bits (Channel 3 input divider) */
#define TMR_CM2_C3IDIV_0                    (0x1U << TMR_CM2_C3IDIV_Pos)            /*!< 0x00000004 */
#define TMR_CM2_C3IDIV_1                    (0x2U << TMR_CM2_C3IDIV_Pos)            /*!< 0x00000008 */

#define TMR_CM2_C3DF_Pos                    (4U)
#define TMR_CM2_C3DF_Msk                    (0xFU << TMR_CM2_C3DF_Pos)              /*!< 0x000000F0 */
#define TMR_CM2_C3DF                        TMR_CM2_C3DF_Msk                        /*!< C3DF[3:0] bits (Channel 3 digital filter) */
#define TMR_CM2_C3DF_0                      (0x1U << TMR_CM2_C3DF_Pos)              /*!< 0x00000010 */
#define TMR_CM2_C3DF_1                      (0x2U << TMR_CM2_C3DF_Pos)              /*!< 0x00000020 */
#define TMR_CM2_C3DF_2                      (0x4U << TMR_CM2_C3DF_Pos)              /*!< 0x00000040 */
#define TMR_CM2_C3DF_3                      (0x8U << TMR_CM2_C3DF_Pos)              /*!< 0x00000080 */

#define TMR_CM2_C4IDIV_Pos                  (10U)
#define TMR_CM2_C4IDIV_Msk                  (0x3U << TMR_CM2_C4IDIV_Pos)            /*!< 0x00000C00 */
#define TMR_CM2_C4IDIV                      TMR_CM2_C4IDIV_Msk                      /*!< C4IDIV[1:0] bits (Channel 4 input divider) */
#define TMR_CM2_C4IDIV_0                    (0x1U << TMR_CM2_C4IDIV_Pos)            /*!< 0x00000400 */
#define TMR_CM2_C4IDIV_1                    (0x2U << TMR_CM2_C4IDIV_Pos)            /*!< 0x00000800 */

#define TMR_CM2_C4DF_Pos                    (12U)
#define TMR_CM2_C4DF_Msk                    (0xFU << TMR_CM2_C4DF_Pos)              /*!< 0x0000F000 */
#define TMR_CM2_C4DF                        TMR_CM2_C4DF_Msk                        /*!< C4DF[3:0] bits (Channel 4 digital filter) */
#define TMR_CM2_C4DF_0                      (0x1U << TMR_CM2_C4DF_Pos)              /*!< 0x00001000 */
#define TMR_CM2_C4DF_1                      (0x2U << TMR_CM2_C4DF_Pos)              /*!< 0x00002000 */
#define TMR_CM2_C4DF_2                      (0x4U << TMR_CM2_C4DF_Pos)              /*!< 0x00004000 */
#define TMR_CM2_C4DF_3                      (0x8U << TMR_CM2_C4DF_Pos)              /*!< 0x00008000 */

/******************  Bit definition for TMR_CCTRL register  *******************/
#define TMR_CCTRL_C1EN_Pos                  (0U)
#define TMR_CCTRL_C1EN_Msk                  (0x1U << TMR_CCTRL_C1EN_Pos)            /*!< 0x00000001 */
#define TMR_CCTRL_C1EN                      TMR_CCTRL_C1EN_Msk                      /*!< Channel 1 enable */
#define TMR_CCTRL_C1P_Pos                   (1U)
#define TMR_CCTRL_C1P_Msk                   (0x1U << TMR_CCTRL_C1P_Pos)             /*!< 0x00000002 */
#define TMR_CCTRL_C1P                       TMR_CCTRL_C1P_Msk                       /*!< Channel 1 polarity */
#define TMR_CCTRL_C1CEN_Pos                 (2U)
#define TMR_CCTRL_C1CEN_Msk                 (0x1U << TMR_CCTRL_C1CEN_Pos)           /*!< 0x00000004 */
#define TMR_CCTRL_C1CEN                     TMR_CCTRL_C1CEN_Msk                     /*!< Channel 1 complementary enable */
#define TMR_CCTRL_C1CP_Pos                  (3U)
#define TMR_CCTRL_C1CP_Msk                  (0x1U << TMR_CCTRL_C1CP_Pos)            /*!< 0x00000008 */
#define TMR_CCTRL_C1CP                      TMR_CCTRL_C1CP_Msk                      /*!< Channel 1 complementary polarity */
#define TMR_CCTRL_C2EN_Pos                  (4U)
#define TMR_CCTRL_C2EN_Msk                  (0x1U << TMR_CCTRL_C2EN_Pos)            /*!< 0x00000010 */
#define TMR_CCTRL_C2EN                      TMR_CCTRL_C2EN_Msk                      /*!< Channel 2 enable */
#define TMR_CCTRL_C2P_Pos                   (5U)
#define TMR_CCTRL_C2P_Msk                   (0x1U << TMR_CCTRL_C2P_Pos)             /*!< 0x00000020 */
#define TMR_CCTRL_C2P                       TMR_CCTRL_C2P_Msk                       /*!< Channel 2 polarity */
#define TMR_CCTRL_C2CEN_Pos                 (6U)
#define TMR_CCTRL_C2CEN_Msk                 (0x1U << TMR_CCTRL_C2CEN_Pos)           /*!< 0x00000040 */
#define TMR_CCTRL_C2CEN                     TMR_CCTRL_C2CEN_Msk                     /*!< Channel 2 complementary enable */
#define TMR_CCTRL_C2CP_Pos                  (7U)
#define TMR_CCTRL_C2CP_Msk                  (0x1U << TMR_CCTRL_C2CP_Pos)            /*!< 0x00000080 */
#define TMR_CCTRL_C2CP                      TMR_CCTRL_C2CP_Msk                      /*!< Channel 2 complementary polarity */
#define TMR_CCTRL_C3EN_Pos                  (8U)
#define TMR_CCTRL_C3EN_Msk                  (0x1U << TMR_CCTRL_C3EN_Pos)            /*!< 0x00000100 */
#define TMR_CCTRL_C3EN                      TMR_CCTRL_C3EN_Msk                      /*!< Channel 3 enable */
#define TMR_CCTRL_C3P_Pos                   (9U)
#define TMR_CCTRL_C3P_Msk                   (0x1U << TMR_CCTRL_C3P_Pos)             /*!< 0x00000200 */
#define TMR_CCTRL_C3P                       TMR_CCTRL_C3P_Msk                       /*!< Channel 3 polarity */
#define TMR_CCTRL_C3CEN_Pos                 (10U)
#define TMR_CCTRL_C3CEN_Msk                 (0x1U << TMR_CCTRL_C3CEN_Pos)           /*!< 0x00000400 */
#define TMR_CCTRL_C3CEN                     TMR_CCTRL_C3CEN_Msk                     /*!< Channel 3 complementary enable */
#define TMR_CCTRL_C3CP_Pos                  (11U)
#define TMR_CCTRL_C3CP_Msk                  (0x1U << TMR_CCTRL_C3CP_Pos)            /*!< 0x00000800 */
#define TMR_CCTRL_C3CP                      TMR_CCTRL_C3CP_Msk                      /*!< Channel 3 complementary polarity */
#define TMR_CCTRL_C4EN_Pos                  (12U)
#define TMR_CCTRL_C4EN_Msk                  (0x1U << TMR_CCTRL_C4EN_Pos)            /*!< 0x00001000 */
#define TMR_CCTRL_C4EN                      TMR_CCTRL_C4EN_Msk                      /*!< Channel 4 enable */
#define TMR_CCTRL_C4P_Pos                   (13U)
#define TMR_CCTRL_C4P_Msk                   (0x1U << TMR_CCTRL_C4P_Pos)             /*!< 0x00002000 */
#define TMR_CCTRL_C4P                       TMR_CCTRL_C4P_Msk                       /*!< Channel 4 polarity */

