HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
/*******************  Bit definition for RTC_DIVL register  *******************/
#define RTC_DIVL_DIV_Pos                    (0U)
#define RTC_DIVL_DIV_Msk                    (0xFFFFU << RTC_DIVL_DIV_Pos)           /*!< 0x0000FFFF */
#define RTC_DIVL_DIV                        RTC_DIVL_DIV_Msk                        /*!< RTC divider low */

/*****************  Bit definition for RTC_DIVCNTH register  ******************/
#define RTC_DIVCNTH_DIVCNT_Pos              (0U)
#define RTC_DIVCNTH_DIVCNT_Msk              (0xFU << RTC_DIVCNTH_DIVCNT_Pos)        /*!< 0x0000000F */
#define RTC_DIVCNTH_DIVCNT                  RTC_DIVCNTH_DIVCNT_Msk                  /*!< RTC clock divider counter high */

/*****************  Bit definition for RTC_DIVCNTL register  ******************/
#define RTC_DIVCNTL_DIVCNT_Pos              (0U)
#define RTC_DIVCNTL_DIVCNT_Msk              (0xFFFFU << RTC_DIVCNTL_DIVCNT_Pos)     /*!< 0x0000FFFF */
#define RTC_DIVCNTL_DIVCNT                  RTC_DIVCNTL_DIVCNT_Msk                  /*!< RTC clock divider counter low */

/*******************  Bit definition for RTC_CNTH register  *******************/
#define RTC_CNTH_CNT_Pos                    (0U)
#define RTC_CNTH_CNT_Msk                    (0xFFFFU << RTC_CNTH_CNT_Pos)           /*!< 0x0000FFFF */
#define RTC_CNTH_CNT                        RTC_CNTH_CNT_Msk                        /*!< RTC counter value high */

/*******************  Bit definition for RTC_CNTL register  *******************/
#define RTC_CNTL_CNT_Pos                    (0U)
#define RTC_CNTL_CNT_Msk                    (0xFFFFU << RTC_CNTL_CNT_Pos)           /*!< 0x0000FFFF */
#define RTC_CNTL_CNT                        RTC_CNTL_CNT_Msk                        /*!< RTC counter value low */

/*******************  Bit definition for RTC_TAH register  ********************/
#define RTC_TAH_TA_Pos                      (0U)
#define RTC_TAH_TA_Msk                      (0xFFFFU << RTC_TAH_TA_Pos)             /*!< 0x0000FFFF */
#define RTC_TAH_TA                          RTC_TAH_TA_Msk                          /*!< Time alarm clock value high */

/*******************  Bit definition for RTC_TAL register  ********************/
#define RTC_TAL_TA_Pos                      (0U)
#define RTC_TAL_TA_Msk                      (0xFFFFU << RTC_TAL_TA_Pos)             /*!< 0x0000FFFF */
#define RTC_TAL_TA                          RTC_TAL_TA_Msk                          /*!< Time alarm clock value low */

/******************************************************************************/
/*                                                                            */
/*                      Battery powered registers (BPR)                       */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for BPR_DT1 register  ********************/
#define BPR_DT1_DT_Pos                      (0U)
#define BPR_DT1_DT_Msk                      (0xFFFFU << BPR_DT1_DT_Pos)             /*!< 0x0000FFFF */
#define BPR_DT1_DT                          BPR_DT1_DT_Msk                          /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT2 register  ********************/
#define BPR_DT2_DT_Pos                      (0U)
#define BPR_DT2_DT_Msk                      (0xFFFFU << BPR_DT2_DT_Pos)             /*!< 0x0000FFFF */
#define BPR_DT2_DT                          BPR_DT2_DT_Msk                          /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT3 register  ********************/
#define BPR_DT3_DT_Pos                      (0U)
#define BPR_DT3_DT_Msk                      (0xFFFFU << BPR_DT3_DT_Pos)             /*!< 0x0000FFFF */
#define BPR_DT3_DT                          BPR_DT3_DT_Msk                          /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT4 register  ********************/
#define BPR_DT4_DT_Pos                      (0U)
#define BPR_DT4_DT_Msk                      (0xFFFFU << BPR_DT4_DT_Pos)             /*!< 0x0000FFFF */
#define BPR_DT4_DT                          BPR_DT4_DT_Msk                          /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT5 register  ********************/
#define BPR_DT5_DT_Pos                      (0U)
#define BPR_DT5_DT_Msk                      (0xFFFFU << BPR_DT5_DT_Pos)             /*!< 0x0000FFFF */
#define BPR_DT5_DT                          BPR_DT5_DT_Msk                          /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT6 register  ********************/
#define BPR_DT6_DT_Pos                      (0U)
#define BPR_DT6_DT_Msk                      (0xFFFFU << BPR_DT6_DT_Pos)             /*!< 0x0000FFFF */
#define BPR_DT6_DT                          BPR_DT6_DT_Msk                          /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT7 register  ********************/
#define BPR_DT7_DT_Pos                      (0U)
#define BPR_DT7_DT_Msk                      (0xFFFFU << BPR_DT7_DT_Pos)             /*!< 0x0000FFFF */
#define BPR_DT7_DT                          BPR_DT7_DT_Msk                          /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT8 register  ********************/
#define BPR_DT8_DT_Pos                      (0U)
#define BPR_DT8_DT_Msk                      (0xFFFFU << BPR_DT8_DT_Pos)             /*!< 0x0000FFFF */
#define BPR_DT8_DT                          BPR_DT8_DT_Msk                          /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT9 register  ********************/
#define BPR_DT9_DT_Pos                      (0U)
#define BPR_DT9_DT_Msk                      (0xFFFFU << BPR_DT9_DT_Pos)             /*!< 0x0000FFFF */
#define BPR_DT9_DT                          BPR_DT9_DT_Msk                          /*!< Battery powered domain data */

