HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
#define ADC_OSQ2_OSN8_Pos                   (5U)
#define ADC_OSQ2_OSN8_Msk                   (0x1FU << ADC_OSQ2_OSN8_Pos)            /*!< 0x000003E0 */
#define ADC_OSQ2_OSN8                       ADC_OSQ2_OSN8_Msk                       /*!< OSN8[4:0] bits (Number of 8th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN8_0                     (0x01U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000020 */
#define ADC_OSQ2_OSN8_1                     (0x02U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000040 */
#define ADC_OSQ2_OSN8_2                     (0x04U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000080 */
#define ADC_OSQ2_OSN8_3                     (0x08U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000100 */
#define ADC_OSQ2_OSN8_4                     (0x10U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000200 */

#define ADC_OSQ2_OSN9_Pos                   (10U)
#define ADC_OSQ2_OSN9_Msk                   (0x1FU << ADC_OSQ2_OSN9_Pos)            /*!< 0x00007C00 */
#define ADC_OSQ2_OSN9                       ADC_OSQ2_OSN9_Msk                       /*!< OSN9[4:0] bits (Number of 9th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN9_0                     (0x01U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00000400 */
#define ADC_OSQ2_OSN9_1                     (0x02U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00000800 */
#define ADC_OSQ2_OSN9_2                     (0x04U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00001000 */
#define ADC_OSQ2_OSN9_3                     (0x08U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00002000 */
#define ADC_OSQ2_OSN9_4                     (0x10U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00004000 */

#define ADC_OSQ2_OSN10_Pos                  (15U)
#define ADC_OSQ2_OSN10_Msk                  (0x1FU << ADC_OSQ2_OSN10_Pos)           /*!< 0x000F8000 */
#define ADC_OSQ2_OSN10                      ADC_OSQ2_OSN10_Msk                      /*!< OSN10[4:0] bits (Number of 10th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN10_0                    (0x01U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00008000 */
#define ADC_OSQ2_OSN10_1                    (0x02U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00010000 */
#define ADC_OSQ2_OSN10_2                    (0x04U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00020000 */
#define ADC_OSQ2_OSN10_3                    (0x08U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00040000 */
#define ADC_OSQ2_OSN10_4                    (0x10U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00080000 */

#define ADC_OSQ2_OSN11_Pos                  (20U)
#define ADC_OSQ2_OSN11_Msk                  (0x1FU << ADC_OSQ2_OSN11_Pos)           /*!< 0x01F00000 */
#define ADC_OSQ2_OSN11                      ADC_OSQ2_OSN11_Msk                      /*!< OSN11[4:0] bits (Number of 11th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN11_0                    (0x01U << ADC_OSQ2_OSN11_Pos)           /*!< 0x00100000 */
#define ADC_OSQ2_OSN11_1                    (0x02U << ADC_OSQ2_OSN11_Pos)           /*!< 0x00200000 */
#define ADC_OSQ2_OSN11_2                    (0x04U << ADC_OSQ2_OSN11_Pos)           /*!< 0x00400000 */
#define ADC_OSQ2_OSN11_3                    (0x08U << ADC_OSQ2_OSN11_Pos)           /*!< 0x00800000 */
#define ADC_OSQ2_OSN11_4                    (0x10U << ADC_OSQ2_OSN11_Pos)           /*!< 0x01000000 */

#define ADC_OSQ2_OSN12_Pos                  (25U)
#define ADC_OSQ2_OSN12_Msk                  (0x1FU << ADC_OSQ2_OSN12_Pos)           /*!< 0x3E000000 */
#define ADC_OSQ2_OSN12                      ADC_OSQ2_OSN12_Msk                      /*!< OSN12[4:0] bits (Number of 12th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN12_0                    (0x01U << ADC_OSQ2_OSN12_Pos)           /*!< 0x02000000 */
#define ADC_OSQ2_OSN12_1                    (0x02U << ADC_OSQ2_OSN12_Pos)           /*!< 0x04000000 */
#define ADC_OSQ2_OSN12_2                    (0x04U << ADC_OSQ2_OSN12_Pos)           /*!< 0x08000000 */
#define ADC_OSQ2_OSN12_3                    (0x08U << ADC_OSQ2_OSN12_Pos)           /*!< 0x10000000 */
#define ADC_OSQ2_OSN12_4                    (0x10U << ADC_OSQ2_OSN12_Pos)           /*!< 0x20000000 */

/*******************  Bit definition for ADC_OSQ3 register  *******************/
#define ADC_OSQ3_OSN1_Pos                   (0U)
#define ADC_OSQ3_OSN1_Msk                   (0x1FU << ADC_OSQ3_OSN1_Pos)            /*!< 0x0000001F */
#define ADC_OSQ3_OSN1                       ADC_OSQ3_OSN1_Msk                       /*!< OSN1[4:0] bits (Number of 1st conversion in ordinary sequence) */
#define ADC_OSQ3_OSN1_0                     (0x01U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000001 */
#define ADC_OSQ3_OSN1_1                     (0x02U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000002 */
#define ADC_OSQ3_OSN1_2                     (0x04U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000004 */
#define ADC_OSQ3_OSN1_3                     (0x08U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000008 */
#define ADC_OSQ3_OSN1_4                     (0x10U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000010 */

#define ADC_OSQ3_OSN2_Pos                   (5U)
#define ADC_OSQ3_OSN2_Msk                   (0x1FU << ADC_OSQ3_OSN2_Pos)            /*!< 0x000003E0 */
#define ADC_OSQ3_OSN2                       ADC_OSQ3_OSN2_Msk                       /*!< OSN2[4:0] bits (Number of 2nd conversion in ordinary sequence) */
#define ADC_OSQ3_OSN2_0                     (0x01U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000020 */
#define ADC_OSQ3_OSN2_1                     (0x02U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000040 */
#define ADC_OSQ3_OSN2_2                     (0x04U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000080 */
#define ADC_OSQ3_OSN2_3                     (0x08U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000100 */
#define ADC_OSQ3_OSN2_4                     (0x10U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000200 */

#define ADC_OSQ3_OSN3_Pos                   (10U)
#define ADC_OSQ3_OSN3_Msk                   (0x1FU << ADC_OSQ3_OSN3_Pos)            /*!< 0x00007C00 */
#define ADC_OSQ3_OSN3                       ADC_OSQ3_OSN3_Msk                       /*!< OSN3[4:0] bits (Number of 3rd conversion in ordinary sequence) */
#define ADC_OSQ3_OSN3_0                     (0x01U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00000400 */
#define ADC_OSQ3_OSN3_1                     (0x02U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00000800 */
#define ADC_OSQ3_OSN3_2                     (0x04U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00001000 */
#define ADC_OSQ3_OSN3_3                     (0x08U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00002000 */
#define ADC_OSQ3_OSN3_4                     (0x10U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00004000 */

#define ADC_OSQ3_OSN4_Pos                   (15U)
#define ADC_OSQ3_OSN4_Msk                   (0x1FU << ADC_OSQ3_OSN4_Pos)            /*!< 0x000F8000 */
#define ADC_OSQ3_OSN4                       ADC_OSQ3_OSN4_Msk                       /*!< OSN4[4:0] bits (Number of 4th conversion in ordinary sequence) */
#define ADC_OSQ3_OSN4_0                     (0x01U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00008000 */
#define ADC_OSQ3_OSN4_1                     (0x02U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00010000 */
#define ADC_OSQ3_OSN4_2                     (0x04U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00020000 */
#define ADC_OSQ3_OSN4_3                     (0x08U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00040000 */
#define ADC_OSQ3_OSN4_4                     (0x10U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00080000 */

