HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
/*****************  Bit definition for XMC_BK2TMGSP register  *****************/
#define XMC_BK2TMGSP_SPST_Pos               (0U)
#define XMC_BK2TMGSP_SPST_Msk               (0xFFU << XMC_BK2TMGSP_SPST_Pos)        /*!< 0x000000FF */
#define XMC_BK2TMGSP_SPST                   XMC_BK2TMGSP_SPST_Msk                   /*!< SPST[7:0] bits (Special memory setup time) */
#define XMC_BK2TMGSP_SPST_0                 (0x01U << XMC_BK2TMGSP_SPST_Pos)        /*!< 0x00000001 */
#define XMC_BK2TMGSP_SPST_1                 (0x02U << XMC_BK2TMGSP_SPST_Pos)        /*!< 0x00000002 */
#define XMC_BK2TMGSP_SPST_2                 (0x04U << XMC_BK2TMGSP_SPST_Pos)        /*!< 0x00000004 */
#define XMC_BK2TMGSP_SPST_3                 (0x08U << XMC_BK2TMGSP_SPST_Pos)        /*!< 0x00000008 */
#define XMC_BK2TMGSP_SPST_4                 (0x10U << XMC_BK2TMGSP_SPST_Pos)        /*!< 0x00000010 */
#define XMC_BK2TMGSP_SPST_5                 (0x20U << XMC_BK2TMGSP_SPST_Pos)        /*!< 0x00000020 */
#define XMC_BK2TMGSP_SPST_6                 (0x40U << XMC_BK2TMGSP_SPST_Pos)        /*!< 0x00000040 */
#define XMC_BK2TMGSP_SPST_7                 (0x80U << XMC_BK2TMGSP_SPST_Pos)        /*!< 0x00000080 */

#define XMC_BK2TMGSP_SPWT_Pos               (8U)
#define XMC_BK2TMGSP_SPWT_Msk               (0xFFU << XMC_BK2TMGSP_SPWT_Pos)        /*!< 0x0000FF00 */
#define XMC_BK2TMGSP_SPWT                   XMC_BK2TMGSP_SPWT_Msk                   /*!< SPWT[7:0] bits (Special memory wait time) */
#define XMC_BK2TMGSP_SPWT_0                 (0x01U << XMC_BK2TMGSP_SPWT_Pos)        /*!< 0x00000100 */
#define XMC_BK2TMGSP_SPWT_1                 (0x02U << XMC_BK2TMGSP_SPWT_Pos)        /*!< 0x00000200 */
#define XMC_BK2TMGSP_SPWT_2                 (0x04U << XMC_BK2TMGSP_SPWT_Pos)        /*!< 0x00000400 */
#define XMC_BK2TMGSP_SPWT_3                 (0x08U << XMC_BK2TMGSP_SPWT_Pos)        /*!< 0x00000800 */
#define XMC_BK2TMGSP_SPWT_4                 (0x10U << XMC_BK2TMGSP_SPWT_Pos)        /*!< 0x00001000 */
#define XMC_BK2TMGSP_SPWT_5                 (0x20U << XMC_BK2TMGSP_SPWT_Pos)        /*!< 0x00002000 */
#define XMC_BK2TMGSP_SPWT_6                 (0x40U << XMC_BK2TMGSP_SPWT_Pos)        /*!< 0x00004000 */
#define XMC_BK2TMGSP_SPWT_7                 (0x80U << XMC_BK2TMGSP_SPWT_Pos)        /*!< 0x00008000 */

#define XMC_BK2TMGSP_SPHT_Pos               (16U)
#define XMC_BK2TMGSP_SPHT_Msk               (0xFFU << XMC_BK2TMGSP_SPHT_Pos)        /*!< 0x00FF0000 */
#define XMC_BK2TMGSP_SPHT                   XMC_BK2TMGSP_SPHT_Msk                   /*!< SPHT[7:0] bits (Special memory hold time) */
#define XMC_BK2TMGSP_SPHT_0                 (0x01U << XMC_BK2TMGSP_SPHT_Pos)        /*!< 0x00010000 */
#define XMC_BK2TMGSP_SPHT_1                 (0x02U << XMC_BK2TMGSP_SPHT_Pos)        /*!< 0x00020000 */
#define XMC_BK2TMGSP_SPHT_2                 (0x04U << XMC_BK2TMGSP_SPHT_Pos)        /*!< 0x00040000 */
#define XMC_BK2TMGSP_SPHT_3                 (0x08U << XMC_BK2TMGSP_SPHT_Pos)        /*!< 0x00080000 */
#define XMC_BK2TMGSP_SPHT_4                 (0x10U << XMC_BK2TMGSP_SPHT_Pos)        /*!< 0x00100000 */
#define XMC_BK2TMGSP_SPHT_5                 (0x20U << XMC_BK2TMGSP_SPHT_Pos)        /*!< 0x00200000 */
#define XMC_BK2TMGSP_SPHT_6                 (0x40U << XMC_BK2TMGSP_SPHT_Pos)        /*!< 0x00400000 */
#define XMC_BK2TMGSP_SPHT_7                 (0x80U << XMC_BK2TMGSP_SPHT_Pos)        /*!< 0x00800000 */

#define XMC_BK2TMGSP_SPDHIZT_Pos            (24U)
#define XMC_BK2TMGSP_SPDHIZT_Msk            (0xFFU << XMC_BK2TMGSP_SPDHIZT_Pos)     /*!< 0xFF000000 */
#define XMC_BK2TMGSP_SPDHIZT                XMC_BK2TMGSP_SPDHIZT_Msk                /*!< SPDHIZT[7:0] bits (Special memory data bus high resistance time) */
#define XMC_BK2TMGSP_SPDHIZT_0              (0x01U << XMC_BK2TMGSP_SPDHIZT_Pos)     /*!< 0x01000000 */
#define XMC_BK2TMGSP_SPDHIZT_1              (0x02U << XMC_BK2TMGSP_SPDHIZT_Pos)     /*!< 0x02000000 */
#define XMC_BK2TMGSP_SPDHIZT_2              (0x04U << XMC_BK2TMGSP_SPDHIZT_Pos)     /*!< 0x04000000 */
#define XMC_BK2TMGSP_SPDHIZT_3              (0x08U << XMC_BK2TMGSP_SPDHIZT_Pos)     /*!< 0x08000000 */
#define XMC_BK2TMGSP_SPDHIZT_4              (0x10U << XMC_BK2TMGSP_SPDHIZT_Pos)     /*!< 0x10000000 */
#define XMC_BK2TMGSP_SPDHIZT_5              (0x20U << XMC_BK2TMGSP_SPDHIZT_Pos)     /*!< 0x20000000 */
#define XMC_BK2TMGSP_SPDHIZT_6              (0x40U << XMC_BK2TMGSP_SPDHIZT_Pos)     /*!< 0x40000000 */
#define XMC_BK2TMGSP_SPDHIZT_7              (0x80U << XMC_BK2TMGSP_SPDHIZT_Pos)     /*!< 0x80000000 */

/******************  Bit definition for XMC_BK2ECC register  ******************/
#define XMC_BK2ECC_ECC_Pos                  (0U)
#define XMC_BK2ECC_ECC_Msk                  (0xFFFFFFFFU << XMC_BK2ECC_ECC_Pos)     /*!< 0xFFFFFFFF */
#define XMC_BK2ECC_ECC                      XMC_BK2ECC_ECC_Msk                      /*!< ECC value */

/******************************************************************************/
/*                                                                            */
/*                   SD/SDIO MMC card host interface (SDIO)                   */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for SDIO_PWRCTRL register  *****************/
#define SDIO_PWRCTRL_PS_Pos                 (0U)
#define SDIO_PWRCTRL_PS_Msk                 (0x3U << SDIO_PWRCTRL_PS_Pos)           /*!< 0x00000003 */
#define SDIO_PWRCTRL_PS                     SDIO_PWRCTRL_PS_Msk                     /*!< PS[1:0] bits (Power switch) */
#define SDIO_PWRCTRL_PS_0                   (0x1U << SDIO_PWRCTRL_PS_Pos)           /*!< 0x00000001 */
#define SDIO_PWRCTRL_PS_1                   (0x2U << SDIO_PWRCTRL_PS_Pos)           /*!< 0x00000002 */

/*****************  Bit definition for SDIO_CLKCTRL register  *****************/
#define SDIO_CLKCTRL_CLKDIV_Pos             (0U)
#define SDIO_CLKCTRL_CLKDIV_Msk             (0xFFU << SDIO_CLKCTRL_CLKDIV_Pos)      /*!< 0x000000FF */
#define SDIO_CLKCTRL_CLKDIV                 SDIO_CLKCTRL_CLKDIV_Msk                 /*!< Clock division */
#define SDIO_CLKCTRL_CLKOEN_Pos             (8U)
#define SDIO_CLKCTRL_CLKOEN_Msk             (0x1U << SDIO_CLKCTRL_CLKOEN_Pos)       /*!< 0x00000100 */
#define SDIO_CLKCTRL_CLKOEN                 SDIO_CLKCTRL_CLKOEN_Msk                 /*!< Clock output enable */
#define SDIO_CLKCTRL_PWRSVEN_Pos            (9U)
#define SDIO_CLKCTRL_PWRSVEN_Msk            (0x1U << SDIO_CLKCTRL_PWRSVEN_Pos)      /*!< 0x00000200 */
#define SDIO_CLKCTRL_PWRSVEN                SDIO_CLKCTRL_PWRSVEN_Msk                /*!< Power saving mode enable */
#define SDIO_CLKCTRL_BYPSEN_Pos             (10U)
#define SDIO_CLKCTRL_BYPSEN_Msk             (0x1U << SDIO_CLKCTRL_BYPSEN_Pos)       /*!< 0x00000400 */
#define SDIO_CLKCTRL_BYPSEN                 SDIO_CLKCTRL_BYPSEN_Msk                 /*!< Clock divider bypass enable bit */

#define SDIO_CLKCTRL_BUSWS_Pos              (11U)
#define SDIO_CLKCTRL_BUSWS_Msk              (0x3U << SDIO_CLKCTRL_BUSWS_Pos)        /*!< 0x00001800 */
#define SDIO_CLKCTRL_BUSWS                  SDIO_CLKCTRL_BUSWS_Msk                  /*!< BUSWS[1:0] bits (Bus width selection) */
#define SDIO_CLKCTRL_BUSWS_0                (0x1U << SDIO_CLKCTRL_BUSWS_Pos)        /*!< 0x00000800 */
#define SDIO_CLKCTRL_BUSWS_1                (0x2U << SDIO_CLKCTRL_BUSWS_Pos)        /*!< 0x00001000 */

#define SDIO_CLKCTRL_CLKEGS_Pos             (13U)
#define SDIO_CLKCTRL_CLKEGS_Msk             (0x1U << SDIO_CLKCTRL_CLKEGS_Pos)       /*!< 0x00002000 */
#define SDIO_CLKCTRL_CLKEGS                 SDIO_CLKCTRL_CLKEGS_Msk                 /*!< SDIO_CK edge selection */
#define SDIO_CLKCTRL_HFCEN_Pos              (14U)
#define SDIO_CLKCTRL_HFCEN_Msk              (0x1U << SDIO_CLKCTRL_HFCEN_Pos)        /*!< 0x00004000 */
#define SDIO_CLKCTRL_HFCEN                  SDIO_CLKCTRL_HFCEN_Msk                  /*!< Hardware flow control enable */

