HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
/******************  Bit definition for SDIO_INTEN register  ******************/
#define SDIO_INTEN_CMDFAILIEN_Pos           (0U)
#define SDIO_INTEN_CMDFAILIEN_Msk           (0x1U << SDIO_INTEN_CMDFAILIEN_Pos)     /*!< 0x00000001 */
#define SDIO_INTEN_CMDFAILIEN               SDIO_INTEN_CMDFAILIEN_Msk               /*!< Command CRC fail interrupt enable */
#define SDIO_INTEN_DTFAILIEN_Pos            (1U)
#define SDIO_INTEN_DTFAILIEN_Msk            (0x1U << SDIO_INTEN_DTFAILIEN_Pos)      /*!< 0x00000002 */
#define SDIO_INTEN_DTFAILIEN                SDIO_INTEN_DTFAILIEN_Msk                /*!< Data CRC fail interrupt enable */
#define SDIO_INTEN_CMDTIMEOUTIEN_Pos        (2U)
#define SDIO_INTEN_CMDTIMEOUTIEN_Msk        (0x1U << SDIO_INTEN_CMDTIMEOUTIEN_Pos)  /*!< 0x00000004 */
#define SDIO_INTEN_CMDTIMEOUTIEN            SDIO_INTEN_CMDTIMEOUTIEN_Msk            /*!< Command timeout interrupt enable */
#define SDIO_INTEN_DTTIMEOUTIEN_Pos         (3U)
#define SDIO_INTEN_DTTIMEOUTIEN_Msk         (0x1U << SDIO_INTEN_DTTIMEOUTIEN_Pos)   /*!< 0x00000008 */
#define SDIO_INTEN_DTTIMEOUTIEN             SDIO_INTEN_DTTIMEOUTIEN_Msk             /*!< Data timeout interrupt enable */
#define SDIO_INTEN_TXERRUIEN_Pos            (4U)
#define SDIO_INTEN_TXERRUIEN_Msk            (0x1U << SDIO_INTEN_TXERRUIEN_Pos)      /*!< 0x00000010 */
#define SDIO_INTEN_TXERRUIEN                SDIO_INTEN_TXERRUIEN_Msk                /*!< TxBUF underrun error interrupt enable */
#define SDIO_INTEN_RXERROIEN_Pos            (5U)
#define SDIO_INTEN_RXERROIEN_Msk            (0x1U << SDIO_INTEN_RXERROIEN_Pos)      /*!< 0x00000020 */
#define SDIO_INTEN_RXERROIEN                SDIO_INTEN_RXERROIEN_Msk                /*!< RxBUF overrun error interrupt enable */
#define SDIO_INTEN_CMDRSPCMPLIEN_Pos        (6U)
#define SDIO_INTEN_CMDRSPCMPLIEN_Msk        (0x1U << SDIO_INTEN_CMDRSPCMPLIEN_Pos)  /*!< 0x00000040 */
#define SDIO_INTEN_CMDRSPCMPLIEN            SDIO_INTEN_CMDRSPCMPLIEN_Msk            /*!< Command response received interrupt enable */
#define SDIO_INTEN_CMDCMPLIEN_Pos           (7U)
#define SDIO_INTEN_CMDCMPLIEN_Msk           (0x1U << SDIO_INTEN_CMDCMPLIEN_Pos)     /*!< 0x00000080 */
#define SDIO_INTEN_CMDCMPLIEN               SDIO_INTEN_CMDCMPLIEN_Msk               /*!< Command sent interrupt enable */
#define SDIO_INTEN_DTCMPLIEN_Pos            (8U)
#define SDIO_INTEN_DTCMPLIEN_Msk            (0x1U << SDIO_INTEN_DTCMPLIEN_Pos)      /*!< 0x00000100 */
#define SDIO_INTEN_DTCMPLIEN                SDIO_INTEN_DTCMPLIEN_Msk                /*!< Data end interrupt enable */
#define SDIO_INTEN_SBITERRIEN_Pos           (9U)
#define SDIO_INTEN_SBITERRIEN_Msk           (0x1U << SDIO_INTEN_SBITERRIEN_Pos)     /*!< 0x00000200 */
#define SDIO_INTEN_SBITERRIEN               SDIO_INTEN_SBITERRIEN_Msk               /*!< Start bit error interrupt enable */
#define SDIO_INTEN_DTBLKCMPLIEN_Pos         (10U)
#define SDIO_INTEN_DTBLKCMPLIEN_Msk         (0x1U << SDIO_INTEN_DTBLKCMPLIEN_Pos)   /*!< 0x00000400 */
#define SDIO_INTEN_DTBLKCMPLIEN             SDIO_INTEN_DTBLKCMPLIEN_Msk             /*!< Data block end interrupt enable */
#define SDIO_INTEN_DOCMDIEN_Pos             (11U)
#define SDIO_INTEN_DOCMDIEN_Msk             (0x1U << SDIO_INTEN_DOCMDIEN_Pos)       /*!< 0x00000800 */
#define SDIO_INTEN_DOCMDIEN                 SDIO_INTEN_DOCMDIEN_Msk                 /*!< Command acting interrupt enable */
#define SDIO_INTEN_DOTXIEN_Pos              (12U)
#define SDIO_INTEN_DOTXIEN_Msk              (0x1U << SDIO_INTEN_DOTXIEN_Pos)        /*!< 0x00001000 */
#define SDIO_INTEN_DOTXIEN                  SDIO_INTEN_DOTXIEN_Msk                  /*!< Data transmit acting interrupt enable */
#define SDIO_INTEN_DORXIEN_Pos              (13U)
#define SDIO_INTEN_DORXIEN_Msk              (0x1U << SDIO_INTEN_DORXIEN_Pos)        /*!< 0x00002000 */
#define SDIO_INTEN_DORXIEN                  SDIO_INTEN_DORXIEN_Msk                  /*!< Data receive acting interrupt enable */
#define SDIO_INTEN_TXBUFHIEN_Pos            (14U)
#define SDIO_INTEN_TXBUFHIEN_Msk            (0x1U << SDIO_INTEN_TXBUFHIEN_Pos)      /*!< 0x00004000 */
#define SDIO_INTEN_TXBUFHIEN                SDIO_INTEN_TXBUFHIEN_Msk                /*!< TxBUF half empty interrupt enable */
#define SDIO_INTEN_RXBUFHIEN_Pos            (15U)
#define SDIO_INTEN_RXBUFHIEN_Msk            (0x1U << SDIO_INTEN_RXBUFHIEN_Pos)      /*!< 0x00008000 */
#define SDIO_INTEN_RXBUFHIEN                SDIO_INTEN_RXBUFHIEN_Msk                /*!< RxBUF half full interrupt enable */
#define SDIO_INTEN_TXBUFFIEN_Pos            (16U)
#define SDIO_INTEN_TXBUFFIEN_Msk            (0x1U << SDIO_INTEN_TXBUFFIEN_Pos)      /*!< 0x00010000 */
#define SDIO_INTEN_TXBUFFIEN                SDIO_INTEN_TXBUFFIEN_Msk                /*!< TxBUF full interrupt enable */
#define SDIO_INTEN_RXBUFFIEN_Pos            (17U)
#define SDIO_INTEN_RXBUFFIEN_Msk            (0x1U << SDIO_INTEN_RXBUFFIEN_Pos)      /*!< 0x00020000 */
#define SDIO_INTEN_RXBUFFIEN                SDIO_INTEN_RXBUFFIEN_Msk                /*!< RxBUF full interrupt enable */
#define SDIO_INTEN_TXBUFEIEN_Pos            (18U)
#define SDIO_INTEN_TXBUFEIEN_Msk            (0x1U << SDIO_INTEN_TXBUFEIEN_Pos)      /*!< 0x00040000 */
#define SDIO_INTEN_TXBUFEIEN                SDIO_INTEN_TXBUFEIEN_Msk                /*!< TxBUF empty interrupt enable */
#define SDIO_INTEN_RXBUFEIEN_Pos            (19U)
#define SDIO_INTEN_RXBUFEIEN_Msk            (0x1U << SDIO_INTEN_RXBUFEIEN_Pos)      /*!< 0x00080000 */
#define SDIO_INTEN_RXBUFEIEN                SDIO_INTEN_RXBUFEIEN_Msk                /*!< RxBUF empty interrupt enable */
#define SDIO_INTEN_TXBUFIEN_Pos             (20U)
#define SDIO_INTEN_TXBUFIEN_Msk             (0x1U << SDIO_INTEN_TXBUFIEN_Pos)       /*!< 0x00100000 */
#define SDIO_INTEN_TXBUFIEN                 SDIO_INTEN_TXBUFIEN_Msk                 /*!< Data available in TxBUF interrupt enable */
#define SDIO_INTEN_RXBUFIEN_Pos             (21U)
#define SDIO_INTEN_RXBUFIEN_Msk             (0x1U << SDIO_INTEN_RXBUFIEN_Pos)       /*!< 0x00200000 */
#define SDIO_INTEN_RXBUFIEN                 SDIO_INTEN_RXBUFIEN_Msk                 /*!< Data available in RxBUF interrupt enable */
#define SDIO_INTEN_IOIFIEN_Pos              (22U)
#define SDIO_INTEN_IOIFIEN_Msk              (0x1U << SDIO_INTEN_IOIFIEN_Pos)        /*!< 0x00400000 */
#define SDIO_INTEN_IOIFIEN                  SDIO_INTEN_IOIFIEN_Msk                  /*!< SD I/O mode received interrupt enable */

/*****************  Bit definition for SDIO_BUFCNTR register  ******************/
#define SDIO_BUFCNTR_CNT_Pos                (0U)
#define SDIO_BUFCNTR_CNT_Msk                (0xFFFFFFU << SDIO_BUFCNTR_CNT_Pos)     /*!< 0x00FFFFFF */
#define SDIO_BUFCNTR_CNT                    SDIO_BUFCNTR_CNT_Msk                    /*!< Number of words to be written to or read from the BUF */

/*******************  Bit definition for SDIO_BUF register  *******************/
#define SDIO_BUF_DT_Pos                     (0U)
#define SDIO_BUF_DT_Msk                     (0xFFFFFFFFU << SDIO_BUF_DT_Pos)        /*!< 0xFFFFFFFF */
#define SDIO_BUF_DT                         SDIO_BUF_DT_Msk                         /*!< Receive and transmit BUF data */

/******************************************************************************/
/*                                                                            */
/*          Universal serial bus full-speed device interface (USBFS)          */
/*                                                                            */
/******************************************************************************/

/*!< Endpoint-specific registers */
#define USB_EPT0                            USB_BASE                                /*!< Endpoint 0 register address */
#define USB_EPT1                            (USB_BASE + 0x00000004)                 /*!< Endpoint 1 register address */
#define USB_EPT2                            (USB_BASE + 0x00000008)                 /*!< Endpoint 2 register address */
#define USB_EPT3                            (USB_BASE + 0x0000000C)                 /*!< Endpoint 3 register address */
#define USB_EPT4                            (USB_BASE + 0x00000010)                 /*!< Endpoint 4 register address */
#define USB_EPT5                            (USB_BASE + 0x00000014)                 /*!< Endpoint 5 register address */
#define USB_EPT6                            (USB_BASE + 0x00000018)                 /*!< Endpoint 6 register address */
#define USB_EPT7                            (USB_BASE + 0x0000001C)                 /*!< Endpoint 7 register address */

