HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
#define USB_EPT3_TXSTS_Pos                  (4U)
#define USB_EPT3_TXSTS_Msk                  (0x3U << USB_EPT3_TXSTS_Pos)            /*!< 0x00000030 */
#define USB_EPT3_TXSTS                      USB_EPT3_TXSTS_Msk                      /*!< TXSTS[1:0] bits (Tx status) */
#define USB_EPT3_TXSTS_0                    (0x1U << USB_EPT3_TXSTS_Pos)            /*!< 0x00000010 */
#define USB_EPT3_TXSTS_1                    (0x2U << USB_EPT3_TXSTS_Pos)            /*!< 0x00000020 */

#define USB_EPT3_TXDTS_Pos                  (6U)
#define USB_EPT3_TXDTS_Msk                  (0x1U << USB_EPT3_TXDTS_Pos)            /*!< 0x00000040 */
#define USB_EPT3_TXDTS                      USB_EPT3_TXDTS_Msk                      /*!< Tx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT3_TXTC_Pos                   (7U)
#define USB_EPT3_TXTC_Msk                   (0x1U << USB_EPT3_TXTC_Pos)             /*!< 0x00000080 */
#define USB_EPT3_TXTC                       USB_EPT3_TXTC_Msk                       /*!< Tx transaction completed */
#define USB_EPT3_EXF_Pos                    (8U)
#define USB_EPT3_EXF_Msk                    (0x1U << USB_EPT3_EXF_Pos)              /*!< 0x00000100 */
#define USB_EPT3_EXF                        USB_EPT3_EXF_Msk                        /*!< Endpoint extend function */

#define USB_EPT3_TRANS_TYPE_Pos             (9U)
#define USB_EPT3_TRANS_TYPE_Msk             (0x3U << USB_EPT3_TRANS_TYPE_Pos)       /*!< 0x00000600 */
#define USB_EPT3_TRANS_TYPE                 USB_EPT3_TRANS_TYPE_Msk                 /*!< TRANS_TYPE[1:0] bits (Transfer type) */
#define USB_EPT3_TRANS_TYPE_0               (0x1U << USB_EPT3_TRANS_TYPE_Pos)       /*!< 0x00000200 */
#define USB_EPT3_TRANS_TYPE_1               (0x2U << USB_EPT3_TRANS_TYPE_Pos)       /*!< 0x00000400 */

#define USB_EPT3_SETUPTC_Pos                (11U)
#define USB_EPT3_SETUPTC_Msk                (0x1U << USB_EPT3_SETUPTC_Pos)          /*!< 0x00000800 */
#define USB_EPT3_SETUPTC                    USB_EPT3_SETUPTC_Msk                    /*!< Setup transaction completed */

#define USB_EPT3_RXSTS_Pos                  (12U)
#define USB_EPT3_RXSTS_Msk                  (0x3U << USB_EPT3_RXSTS_Pos)            /*!< 0x00003000 */
#define USB_EPT3_RXSTS                      USB_EPT3_RXSTS_Msk                      /*!< RXSTS[1:0] bits (Rx status) */
#define USB_EPT3_RXSTS_0                    (0x1U << USB_EPT3_RXSTS_Pos)            /*!< 0x00001000 */
#define USB_EPT3_RXSTS_1                    (0x2U << USB_EPT3_RXSTS_Pos)            /*!< 0x00002000 */

#define USB_EPT3_RXDTS_Pos                  (14U)
#define USB_EPT3_RXDTS_Msk                  (0x1U << USB_EPT3_RXDTS_Pos)            /*!< 0x00004000 */
#define USB_EPT3_RXDTS                      USB_EPT3_RXDTS_Msk                      /*!< Rx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT3_RXTC_Pos                   (15U)
#define USB_EPT3_RXTC_Msk                   (0x1U << USB_EPT3_RXTC_Pos)             /*!< 0x00008000 */
#define USB_EPT3_RXTC                       USB_EPT3_RXTC_Msk                       /*!< Rx transaction completed */

/*******************  Bit definition for USB_EPT4 register  *******************/
#define USB_EPT4_EPTADDR_Pos                (0U)
#define USB_EPT4_EPTADDR_Msk                (0xFU << USB_EPT4_EPTADDR_Pos)          /*!< 0x0000000F */
#define USB_EPT4_EPTADDR                    USB_EPT4_EPTADDR_Msk                    /*!< Endpoint address */

#define USB_EPT4_TXSTS_Pos                  (4U)
#define USB_EPT4_TXSTS_Msk                  (0x3U << USB_EPT4_TXSTS_Pos)            /*!< 0x00000030 */
#define USB_EPT4_TXSTS                      USB_EPT4_TXSTS_Msk                      /*!< TXSTS[1:0] bits (Tx status) */
#define USB_EPT4_TXSTS_0                    (0x1U << USB_EPT4_TXSTS_Pos)            /*!< 0x00000010 */
#define USB_EPT4_TXSTS_1                    (0x2U << USB_EPT4_TXSTS_Pos)            /*!< 0x00000020 */

#define USB_EPT4_TXDTS_Pos                  (6U)
#define USB_EPT4_TXDTS_Msk                  (0x1U << USB_EPT4_TXDTS_Pos)            /*!< 0x00000040 */
#define USB_EPT4_TXDTS                      USB_EPT4_TXDTS_Msk                      /*!< Tx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT4_TXTC_Pos                   (7U)
#define USB_EPT4_TXTC_Msk                   (0x1U << USB_EPT4_TXTC_Pos)             /*!< 0x00000080 */
#define USB_EPT4_TXTC                       USB_EPT4_TXTC_Msk                       /*!< Tx transaction completed */
#define USB_EPT4_EXF_Pos                    (8U)
#define USB_EPT4_EXF_Msk                    (0x1U << USB_EPT4_EXF_Pos)              /*!< 0x00000100 */
#define USB_EPT4_EXF                        USB_EPT4_EXF_Msk                        /*!< Endpoint extend function */

#define USB_EPT4_TRANS_TYPE_Pos             (9U)
#define USB_EPT4_TRANS_TYPE_Msk             (0x3U << USB_EPT4_TRANS_TYPE_Pos)       /*!< 0x00000600 */
#define USB_EPT4_TRANS_TYPE                 USB_EPT4_TRANS_TYPE_Msk                 /*!< TRANS_TYPE[1:0] bits (Transfer type) */
#define USB_EPT4_TRANS_TYPE_0               (0x1U << USB_EPT4_TRANS_TYPE_Pos)       /*!< 0x00000200 */
#define USB_EPT4_TRANS_TYPE_1               (0x2U << USB_EPT4_TRANS_TYPE_Pos)       /*!< 0x00000400 */

#define USB_EPT4_SETUPTC_Pos                (11U)
#define USB_EPT4_SETUPTC_Msk                (0x1U << USB_EPT4_SETUPTC_Pos)          /*!< 0x00000800 */
#define USB_EPT4_SETUPTC                    USB_EPT4_SETUPTC_Msk                    /*!< Setup transaction completed */

#define USB_EPT4_RXSTS_Pos                  (12U)
#define USB_EPT4_RXSTS_Msk                  (0x3U << USB_EPT4_RXSTS_Pos)            /*!< 0x00003000 */
#define USB_EPT4_RXSTS                      USB_EPT4_RXSTS_Msk                      /*!< RXSTS[1:0] bits (Rx status) */
#define USB_EPT4_RXSTS_0                    (0x1U << USB_EPT4_RXSTS_Pos)            /*!< 0x00001000 */
#define USB_EPT4_RXSTS_1                    (0x2U << USB_EPT4_RXSTS_Pos)            /*!< 0x00002000 */

#define USB_EPT4_RXDTS_Pos                  (14U)
#define USB_EPT4_RXDTS_Msk                  (0x1U << USB_EPT4_RXDTS_Pos)            /*!< 0x00004000 */
#define USB_EPT4_RXDTS                      USB_EPT4_RXDTS_Msk                      /*!< Rx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT4_RXTC_Pos                   (15U)
#define USB_EPT4_RXTC_Msk                   (0x1U << USB_EPT4_RXTC_Pos)             /*!< 0x00008000 */
#define USB_EPT4_RXTC                       USB_EPT4_RXTC_Msk                       /*!< Rx transaction completed */

/*******************  Bit definition for USB_EPT5 register  *******************/
#define USB_EPT5_EPTADDR_Pos                (0U)
#define USB_EPT5_EPTADDR_Msk                (0xFU << USB_EPT5_EPTADDR_Pos)          /*!< 0x0000000F */
#define USB_EPT5_EPTADDR                    USB_EPT5_EPTADDR_Msk                    /*!< Endpoint address */

#define USB_EPT5_TXSTS_Pos                  (4U)
#define USB_EPT5_TXSTS_Msk                  (0x3U << USB_EPT5_TXSTS_Pos)            /*!< 0x00000030 */
#define USB_EPT5_TXSTS                      USB_EPT5_TXSTS_Msk                      /*!< TXSTS[1:0] bits (Tx status) */
#define USB_EPT5_TXSTS_0                    (0x1U << USB_EPT5_TXSTS_Pos)            /*!< 0x00000010 */
#define USB_EPT5_TXSTS_1                    (0x2U << USB_EPT5_TXSTS_Pos)            /*!< 0x00000020 */

