HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
#define USB_R3LEN_0_NBLK_0                  0x00007C00U                             /*!< NBLK_0[4:0] bits (Number of blocks) (low) */
#define USB_R3LEN_0_NBLK_0_0                0x00000400U                             /*!< Bit 0 */
#define USB_R3LEN_0_NBLK_0_1                0x00000800U                             /*!< Bit 1 */
#define USB_R3LEN_0_NBLK_0_2                0x00001000U                             /*!< Bit 2 */
#define USB_R3LEN_0_NBLK_0_3                0x00002000U                             /*!< Bit 3 */
#define USB_R3LEN_0_NBLK_0_4                0x00004000U                             /*!< Bit 4 */

#define USB_R3LEN_0_BSIZE_0                 0x00008000U                             /*!< Block size (low) */

/*****************  Bit definition for USB_R3LEN_1 register  ******************/
#define USB_R3LEN_1_R3LEN_1                 0x03FF0000U                             /*!< Reception Length 3 (high) */

#define USB_R3LEN_1_NBLK_1                  0x7C000000U                             /*!< NBLK_1[4:0] bits (Number of blocks) (high) */
#define USB_R3LEN_1_NBLK_1_0                0x04000000U                             /*!< Bit 0 */
#define USB_R3LEN_1_NBLK_1_1                0x08000000U                             /*!< Bit 1 */
#define USB_R3LEN_1_NBLK_1_2                0x10000000U                             /*!< Bit 2 */
#define USB_R3LEN_1_NBLK_1_3                0x20000000U                             /*!< Bit 3 */
#define USB_R3LEN_1_NBLK_1_4                0x40000000U                             /*!< Bit 4 */

#define USB_R3LEN_1_BSIZE_1                 0x80000000U                             /*!< Block size (high) */

/*****************  Bit definition for USB_R4LEN_0 register  ******************/
#define USB_R4LEN_0_R4LEN_0                 0x000003FFU                             /*!< Reception Length 4 (low) */

#define USB_R4LEN_0_NBLK_0                  0x00007C00U                             /*!< NBLK_0[4:0] bits (Number of blocks) (low) */
#define USB_R4LEN_0_NBLK_0_0                0x00000400U                             /*!< Bit 0 */
#define USB_R4LEN_0_NBLK_0_1                0x00000800U                             /*!< Bit 1 */
#define USB_R4LEN_0_NBLK_0_2                0x00001000U                             /*!< Bit 2 */
#define USB_R4LEN_0_NBLK_0_3                0x00002000U                             /*!< Bit 3 */
#define USB_R4LEN_0_NBLK_0_4                0x00004000U                             /*!< Bit 4 */

#define USB_R4LEN_0_BSIZE_0                 0x00008000U                             /*!< Block size (low) */

/*****************  Bit definition for USB_R4LEN_1 register  ******************/
#define USB_R4LEN_1_R4LEN_1                 0x03FF0000U                             /*!< Reception Length 4 (high) */

#define USB_R4LEN_1_NBLK_1                  0x7C000000U                             /*!< NBLK_1[4:0] bits (Number of blocks) (high) */
#define USB_R4LEN_1_NBLK_1_0                0x04000000U                             /*!< Bit 0 */
#define USB_R4LEN_1_NBLK_1_1                0x08000000U                             /*!< Bit 1 */
#define USB_R4LEN_1_NBLK_1_2                0x10000000U                             /*!< Bit 2 */
#define USB_R4LEN_1_NBLK_1_3                0x20000000U                             /*!< Bit 3 */
#define USB_R4LEN_1_NBLK_1_4                0x40000000U                             /*!< Bit 4 */

#define USB_R4LEN_1_BSIZE_1                 0x80000000U                             /*!< Block size (high) */

/*****************  Bit definition for USB_R5LEN_0 register  ******************/
#define USB_R5LEN_0_R5LEN_0                 0x000003FFU                             /*!< Reception Length 5 (low) */

#define USB_R5LEN_0_NBLK_0                  0x00007C00U                             /*!< NBLK_0[4:0] bits (Number of blocks) (low) */
#define USB_R5LEN_0_NBLK_0_0                0x00000400U                             /*!< Bit 0 */
#define USB_R5LEN_0_NBLK_0_1                0x00000800U                             /*!< Bit 1 */
#define USB_R5LEN_0_NBLK_0_2                0x00001000U                             /*!< Bit 2 */
#define USB_R5LEN_0_NBLK_0_3                0x00002000U                             /*!< Bit 3 */
#define USB_R5LEN_0_NBLK_0_4                0x00004000U                             /*!< Bit 4 */

#define USB_R5LEN_0_BSIZE_0                 0x00008000U                             /*!< Block size (low) */

/*****************  Bit definition for USB_R5LEN_1 register  ******************/
#define USB_R5LEN_1_R5LEN_1                 0x03FF0000U                             /*!< Reception Length 5 (high) */

#define USB_R5LEN_1_NBLK_1                  0x7C000000U                             /*!< NBLK_1[4:0] bits (Number of blocks) (high) */
#define USB_R5LEN_1_NBLK_1_0                0x04000000U                             /*!< Bit 0 */
#define USB_R5LEN_1_NBLK_1_1                0x08000000U                             /*!< Bit 1 */
#define USB_R5LEN_1_NBLK_1_2                0x10000000U                             /*!< Bit 2 */
#define USB_R5LEN_1_NBLK_1_3                0x20000000U                             /*!< Bit 3 */
#define USB_R5LEN_1_NBLK_1_4                0x40000000U                             /*!< Bit 4 */

#define USB_R5LEN_1_BSIZE_1                 0x80000000U                             /*!< Block size (high) */

/*****************  Bit definition for USB_R6LEN_0  register  ******************/
#define USB_R6LEN_0_R6LEN_0                 0x000003FFU                             /*!< Reception Length 6 (low) */

#define USB_R6LEN_0_NBLK_0                  0x00007C00U                             /*!< NBLK_0[4:0] bits (Number of blocks) (low) */
#define USB_R6LEN_0_NBLK_0_0                0x00000400U                             /*!< Bit 0 */
#define USB_R6LEN_0_NBLK_0_1                0x00000800U                             /*!< Bit 1 */
#define USB_R6LEN_0_NBLK_0_2                0x00001000U                             /*!< Bit 2 */
#define USB_R6LEN_0_NBLK_0_3                0x00002000U                             /*!< Bit 3 */
#define USB_R6LEN_0_NBLK_0_4                0x00004000U                             /*!< Bit 4 */

#define USB_R6LEN_0_BSIZE_0                 0x00008000U                             /*!< Block size (low) */

