HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
/*****************  Bit definition for USB_R6LEN_1 register  ******************/
#define USB_R6LEN_1_R6LEN_1                 0x03FF0000U                             /*!< Reception Length 6 (high) */

#define USB_R6LEN_1_NBLK_1                  0x7C000000U                             /*!< NBLK_1[4:0] bits (Number of blocks) (high) */
#define USB_R6LEN_1_NBLK_1_0                0x04000000U                             /*!< Bit 0 */
#define USB_R6LEN_1_NBLK_1_1                0x08000000U                             /*!< Bit 1 */
#define USB_R6LEN_1_NBLK_1_2                0x10000000U                             /*!< Bit 2 */
#define USB_R6LEN_1_NBLK_1_3                0x20000000U                             /*!< Bit 3 */
#define USB_R6LEN_1_NBLK_1_4                0x40000000U                             /*!< Bit 4 */

#define USB_R6LEN_1_BSIZE_1                 0x80000000U                             /*!< Block size (high) */

/*****************  Bit definition for USB_R7LEN_0 register  ******************/
#define USB_R7LEN_0_R7LEN_0                 0x000003FFU                             /*!< Reception Length 7 (low) */

#define USB_R7LEN_0_NBLK_0                  0x00007C00U                             /*!< NBLK_0[4:0] bits (Number of blocks) (low) */
#define USB_R7LEN_0_NBLK_0_0                0x00000400U                             /*!< Bit 0 */
#define USB_R7LEN_0_NBLK_0_1                0x00000800U                             /*!< Bit 1 */
#define USB_R7LEN_0_NBLK_0_2                0x00001000U                             /*!< Bit 2 */
#define USB_R7LEN_0_NBLK_0_3                0x00002000U                             /*!< Bit 3 */
#define USB_R7LEN_0_NBLK_0_4                0x00004000U                             /*!< Bit 4 */

#define USB_R7LEN_0_BSIZE_0                 0x00008000U                             /*!< Block size (low) */

/*****************  Bit definition for USB_R7LEN_1 register  ******************/
#define USB_R7LEN_1_R7LEN_1                 0x03FF0000U                             /*!< Reception Length 7 (high) */

#define USB_R7LEN_1_NBLK_1                  0x7C000000U                             /*!< NBLK_1[4:0] bits (Number of blocks) (high) */
#define USB_R7LEN_1_NBLK_1_0                0x04000000U                             /*!< Bit 0 */
#define USB_R7LEN_1_NBLK_1_1                0x08000000U                             /*!< Bit 1 */
#define USB_R7LEN_1_NBLK_1_2                0x10000000U                             /*!< Bit 2 */
#define USB_R7LEN_1_NBLK_1_3                0x20000000U                             /*!< Bit 3 */
#define USB_R7LEN_1_NBLK_1_4                0x40000000U                             /*!< Bit 4 */

#define USB_R7LEN_1_BSIZE_1                 0x80000000U                             /*!< Block size (high) */

/******************************************************************************/
/*                                                                            */
/*                     HICK auto clock calibration (ACC)                      */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for ACC_STS register  *******************/
#define ACC_STS_CALRDY_Pos                  (0U)
#define ACC_STS_CALRDY_Msk                  (0x1U << ACC_STS_CALRDY_Pos)            /*!< 0x00000001 */
#define ACC_STS_CALRDY                      ACC_STS_CALRDY_Msk                      /*!< Internal high-speed clock calibration ready */
#define ACC_STS_RSLOST_Pos                  (1U)
#define ACC_STS_RSLOST_Msk                  (0x1U << ACC_STS_RSLOST_Pos)            /*!< 0x00000002 */
#define ACC_STS_RSLOST                      ACC_STS_RSLOST_Msk                      /*!< Reference Signal Lost */

/*******************  Bit definition for ACC_CTRL1 register  ******************/
#define ACC_CTRL1_CALON_Pos                 (0U)
#define ACC_CTRL1_CALON_Msk                 (0x1U << ACC_CTRL1_CALON_Pos)           /*!< 0x00000001 */
#define ACC_CTRL1_CALON                     ACC_CTRL1_CALON_Msk                     /*!< Calibration on */
#define ACC_CTRL1_ENTRIM_Pos                (1U)
#define ACC_CTRL1_ENTRIM_Msk                (0x1U << ACC_CTRL1_ENTRIM_Pos)          /*!< 0x00000002 */
#define ACC_CTRL1_ENTRIM                    ACC_CTRL1_ENTRIM_Msk                    /*!< Enable trim */
#define ACC_CTRL1_EIEN_Pos                  (4U)
#define ACC_CTRL1_EIEN_Msk                  (0x1U << ACC_CTRL1_EIEN_Pos)            /*!< 0x00000010 */
#define ACC_CTRL1_EIEN                      ACC_CTRL1_EIEN_Msk                      /*!< RSLOST error interrupt enable */
#define ACC_CTRL1_CALRDYIEN_Pos             (5U)
#define ACC_CTRL1_CALRDYIEN_Msk             (0x1U << ACC_CTRL1_CALRDYIEN_Pos)       /*!< 0x00000020 */
#define ACC_CTRL1_CALRDYIEN                 ACC_CTRL1_CALRDYIEN_Msk                 /*!< CALRDY interrupt enable */
#define ACC_CTRL1_STEP_Pos                  (8U)
#define ACC_CTRL1_STEP_Msk                  (0xFU << ACC_CTRL1_STEP_Pos)            /*!< 0x00000F00 */
#define ACC_CTRL1_STEP                      ACC_CTRL1_STEP_Msk                      /*!< Calibrated step */

/*******************  Bit definition for ACC_CTRL2 register  ******************/
#define ACC_CTRL2_HICKCAL_Pos               (0U)
#define ACC_CTRL2_HICKCAL_Msk               (0xFFU << ACC_CTRL2_HICKCAL_Pos)        /*!< 0x000000FF */
#define ACC_CTRL2_HICKCAL                   ACC_CTRL2_HICKCAL_Msk                   /*!< Internal high-speed auto clock calibration */
#define ACC_CTRL2_HICKTRIM_Pos              (8U)
#define ACC_CTRL2_HICKTRIM_Msk              (0x3FU << ACC_CTRL2_HICKTRIM_Pos)       /*!< 0x00003F00 */
#define ACC_CTRL2_HICKTRIM                  ACC_CTRL2_HICKTRIM_Msk                  /*!< Internal high-speed auto clock trimming */

/********************  Bit definition for ACC_CP1 register  *******************/
#define ACC_CP1_C1_Pos                      (0U)
#define ACC_CP1_C1_Msk                      (0xFFFFU << ACC_CP1_C1_Pos)             /*!< 0x0000FFFF */
#define ACC_CP1_C1                          ACC_CP1_C1_Msk                          /*!< Compare 1 */

