HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axe.h
/********************  Bit definition for ACC_CP2 register  *******************/
#define ACC_CP2_C2_Pos                      (0U)
#define ACC_CP2_C2_Msk                      (0xFFFFU << ACC_CP2_C2_Pos)             /*!< 0x0000FFFF */
#define ACC_CP2_C2                          ACC_CP2_C2_Msk                          /*!< Compare 2 */

/********************  Bit definition for ACC_CP3 register  *******************/
#define ACC_CP3_C3_Pos                      (0U)
#define ACC_CP3_C3_Msk                      (0xFFFFU << ACC_CP3_C3_Pos)             /*!< 0x0000FFFF */
#define ACC_CP3_C3                          ACC_CP3_C3_Msk                          /*!< Compare 3 */

/******************************************************************************/
/*                                                                            */
/*                             Debug MCU (DEBUG)                              */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for DEBUG_IDCODE register  *****************/
#define DEBUG_IDCODE_PID_Pos                (0U)
#define DEBUG_IDCODE_PID_Msk                (0xFFFFFFFFU << DEBUG_IDCODE_PID_Pos)   /*!< 0xFFFFFFFF */
#define DEBUG_IDCODE_PID                    DEBUG_IDCODE_PID_Msk                    /*!< PID[31:0] bits (PID information) */
#define DEBUG_IDCODE_PID_0                  (0x00000001U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000001 */
#define DEBUG_IDCODE_PID_1                  (0x00000002U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000002 */
#define DEBUG_IDCODE_PID_2                  (0x00000004U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000004 */
#define DEBUG_IDCODE_PID_3                  (0x00000008U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000008 */
#define DEBUG_IDCODE_PID_4                  (0x00000010U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000010 */
#define DEBUG_IDCODE_PID_5                  (0x00000020U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000020 */
#define DEBUG_IDCODE_PID_6                  (0x00000040U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000040 */
#define DEBUG_IDCODE_PID_7                  (0x00000080U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000080 */
#define DEBUG_IDCODE_PID_8                  (0x00000100U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000100 */
#define DEBUG_IDCODE_PID_9                  (0x00000200U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000200 */
#define DEBUG_IDCODE_PID_10                 (0x00000400U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000400 */
#define DEBUG_IDCODE_PID_11                 (0x00000800U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000800 */
#define DEBUG_IDCODE_PID_12                 (0x00001000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00001000 */
#define DEBUG_IDCODE_PID_13                 (0x00002000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00002000 */
#define DEBUG_IDCODE_PID_14                 (0x00004000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00004000 */
#define DEBUG_IDCODE_PID_15                 (0x00008000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00008000 */
#define DEBUG_IDCODE_PID_16                 (0x00010000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00010000 */
#define DEBUG_IDCODE_PID_17                 (0x00020000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00020000 */
#define DEBUG_IDCODE_PID_18                 (0x00040000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00040000 */
#define DEBUG_IDCODE_PID_19                 (0x00080000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00080000 */
#define DEBUG_IDCODE_PID_20                 (0x00100000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00100000 */
#define DEBUG_IDCODE_PID_21                 (0x00200000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00200000 */
#define DEBUG_IDCODE_PID_22                 (0x00400000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00400000 */
#define DEBUG_IDCODE_PID_23                 (0x00800000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00800000 */
#define DEBUG_IDCODE_PID_24                 (0x01000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x01000000 */
#define DEBUG_IDCODE_PID_25                 (0x02000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x02000000 */
#define DEBUG_IDCODE_PID_26                 (0x04000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x04000000 */
#define DEBUG_IDCODE_PID_27                 (0x08000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x08000000 */
#define DEBUG_IDCODE_PID_28                 (0x10000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x10000000 */
#define DEBUG_IDCODE_PID_29                 (0x20000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x20000000 */
#define DEBUG_IDCODE_PID_30                 (0x40000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x40000000 */
#define DEBUG_IDCODE_PID_31                 (0x80000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x80000000 */

/******************  Bit definition for DEBUG_CTRL register  ******************/
#define DEBUG_CTRL_SLEEP_DEBUG_Pos          (0U)
#define DEBUG_CTRL_SLEEP_DEBUG_Msk          (0x1U << DEBUG_CTRL_SLEEP_DEBUG_Pos)    /*!< 0x00000001 */
#define DEBUG_CTRL_SLEEP_DEBUG              DEBUG_CTRL_SLEEP_DEBUG_Msk              /*!< Debug Sleep mode control bit */
#define DEBUG_CTRL_DEEPSLEEP_DEBUG_Pos      (1U)                                    /*!< 0x00000002 */
#define DEBUG_CTRL_DEEPSLEEP_DEBUG_Msk      (0x1U << DEBUG_CTRL_DEEPSLEEP_DEBUG_Pos)
#define DEBUG_CTRL_DEEPSLEEP_DEBUG          DEBUG_CTRL_DEEPSLEEP_DEBUG_Msk          /*!< Debug Deep sleep mode control bit */
#define DEBUG_CTRL_STANDBY_DEBUG_Pos        (2U)
#define DEBUG_CTRL_STANDBY_DEBUG_Msk        (0x1U << DEBUG_CTRL_STANDBY_DEBUG_Pos)  /*!< 0x00000004 */
#define DEBUG_CTRL_STANDBY_DEBUG            DEBUG_CTRL_STANDBY_DEBUG_Msk            /*!< Debug Standby mode control bit */
#define DEBUG_CTRL_TRACE_IOEN_Pos           (5U)
#define DEBUG_CTRL_TRACE_IOEN_Msk           (0x1U << DEBUG_CTRL_TRACE_IOEN_Pos)     /*!< 0x00000020 */
#define DEBUG_CTRL_TRACE_IOEN               DEBUG_CTRL_TRACE_IOEN_Msk               /*!< Trace pin assignment enable */

#define DEBUG_CTRL_TRACE_MODE_Pos           (6U)
#define DEBUG_CTRL_TRACE_MODE_Msk           (0x3U << DEBUG_CTRL_TRACE_MODE_Pos)     /*!< 0x000000C0 */
#define DEBUG_CTRL_TRACE_MODE               DEBUG_CTRL_TRACE_MODE_Msk               /*!< TRACE_MODE[1:0] bits (Trace pin assignment control) */
#define DEBUG_CTRL_TRACE_MODE_0             (0x1U << DEBUG_CTRL_TRACE_MODE_Pos)     /*!< 0x00000040 */
#define DEBUG_CTRL_TRACE_MODE_1             (0x2U << DEBUG_CTRL_TRACE_MODE_Pos)     /*!< 0x00000080 */

#define DEBUG_CTRL_WDT_PAUSE_Pos            (8U)
#define DEBUG_CTRL_WDT_PAUSE_Msk            (0x1U << DEBUG_CTRL_WDT_PAUSE_Pos)      /*!< 0x00000100 */
#define DEBUG_CTRL_WDT_PAUSE                DEBUG_CTRL_WDT_PAUSE_Msk                /*!< Watchdog pause control bit */
#define DEBUG_CTRL_WWDT_PAUSE_Pos           (9U)
#define DEBUG_CTRL_WWDT_PAUSE_Msk           (0x1U << DEBUG_CTRL_WWDT_PAUSE_Pos)     /*!< 0x00000200 */
#define DEBUG_CTRL_WWDT_PAUSE               DEBUG_CTRL_WWDT_PAUSE_Msk               /*!< Window watchdog pause control bit */
#define DEBUG_CTRL_TMR1_PAUSE_Pos           (10U)
#define DEBUG_CTRL_TMR1_PAUSE_Msk           (0x1U << DEBUG_CTRL_TMR1_PAUSE_Pos)     /*!< 0x00000400 */
#define DEBUG_CTRL_TMR1_PAUSE               DEBUG_CTRL_TMR1_PAUSE_Msk               /*!< TMR1 pause control bit */
#define DEBUG_CTRL_TMR2_PAUSE_Pos           (11U)
#define DEBUG_CTRL_TMR2_PAUSE_Msk           (0x1U << DEBUG_CTRL_TMR2_PAUSE_Pos)     /*!< 0x00000800 */
#define DEBUG_CTRL_TMR2_PAUSE               DEBUG_CTRL_TMR2_PAUSE_Msk               /*!< TMR2 pause control bit */
#define DEBUG_CTRL_TMR3_PAUSE_Pos           (12U)
#define DEBUG_CTRL_TMR3_PAUSE_Msk           (0x1U << DEBUG_CTRL_TMR3_PAUSE_Pos)     /*!< 0x00001000 */
#define DEBUG_CTRL_TMR3_PAUSE               DEBUG_CTRL_TMR3_PAUSE_Msk               /*!< TMR3 pause control bit */
#define DEBUG_CTRL_TMR4_PAUSE_Pos           (13U)
#define DEBUG_CTRL_TMR4_PAUSE_Msk           (0x1U << DEBUG_CTRL_TMR4_PAUSE_Pos)     /*!< 0x00002000 */
#define DEBUG_CTRL_TMR4_PAUSE               DEBUG_CTRL_TMR4_PAUSE_Msk               /*!< TMR4 pause control bit */
#define DEBUG_CTRL_CAN1_PAUSE_Pos           (14U)
#define DEBUG_CTRL_CAN1_PAUSE_Msk           (0x1U << DEBUG_CTRL_CAN1_PAUSE_Pos)     /*!< 0x00004000 */
#define DEBUG_CTRL_CAN1_PAUSE               DEBUG_CTRL_CAN1_PAUSE_Msk               /*!< CAN1 pause control bit */
#define DEBUG_CTRL_I2C1_SMBUS_TIMEOUT_Pos   (15U)                                   /*!< 0x00008000 */
#define DEBUG_CTRL_I2C1_SMBUS_TIMEOUT_Msk   (0x1U << DEBUG_CTRL_I2C1_SMBUS_TIMEOUT_Pos)
#define DEBUG_CTRL_I2C1_SMBUS_TIMEOUT       DEBUG_CTRL_I2C1_SMBUS_TIMEOUT_Msk       /*!< I2C1 pause control bit */
#define DEBUG_CTRL_I2C2_SMBUS_TIMEOUT_Pos   (16U)                                   /*!< 0x00010000 */
#define DEBUG_CTRL_I2C2_SMBUS_TIMEOUT_Msk   (0x1U << DEBUG_CTRL_I2C2_SMBUS_TIMEOUT_Pos)
#define DEBUG_CTRL_I2C2_SMBUS_TIMEOUT       DEBUG_CTRL_I2C2_SMBUS_TIMEOUT_Msk       /*!< I2C2 pause control bit */
#define DEBUG_CTRL_TMR8_PAUSE_Pos           (17U)
#define DEBUG_CTRL_TMR8_PAUSE_Msk           (0x1U << DEBUG_CTRL_TMR8_PAUSE_Pos)     /*!< 0x00020000 */
#define DEBUG_CTRL_TMR8_PAUSE               DEBUG_CTRL_TMR8_PAUSE_Msk               /*!< TMR8 pause control bit */
#define DEBUG_CTRL_TMR5_PAUSE_Pos           (18U)
#define DEBUG_CTRL_TMR5_PAUSE_Msk           (0x1U << DEBUG_CTRL_TMR5_PAUSE_Pos)     /*!< 0x00040000 */
#define DEBUG_CTRL_TMR5_PAUSE               DEBUG_CTRL_TMR5_PAUSE_Msk               /*!< TMR5 pause control bit */
#define DEBUG_CTRL_TMR6_PAUSE_Pos           (19U)
#define DEBUG_CTRL_TMR6_PAUSE_Msk           (0x1U << DEBUG_CTRL_TMR6_PAUSE_Pos)     /*!< 0x00080000 */
#define DEBUG_CTRL_TMR6_PAUSE               DEBUG_CTRL_TMR6_PAUSE_Msk               /*!< TMR6 pause control bit */
#define DEBUG_CTRL_TMR7_PAUSE_Pos           (20U)
#define DEBUG_CTRL_TMR7_PAUSE_Msk           (0x1U << DEBUG_CTRL_TMR7_PAUSE_Pos)     /*!< 0x00100000 */
#define DEBUG_CTRL_TMR7_PAUSE               DEBUG_CTRL_TMR7_PAUSE_Msk               /*!< TMR7 pause control bit */
#define DEBUG_CTRL_CAN2_PAUSE_Pos           (21U)
#define DEBUG_CTRL_CAN2_PAUSE_Msk           (0x1U << DEBUG_CTRL_CAN2_PAUSE_Pos)     /*!< 0x00100000 */
#define DEBUG_CTRL_CAN2_PAUSE               DEBUG_CTRL_CAN2_PAUSE_Msk               /*!< CAN2 pause control bit */
#define DEBUG_CTRL_TMR12_PAUSE_Pos          (25U)
#define DEBUG_CTRL_TMR12_PAUSE_Msk          (0x1U << DEBUG_CTRL_TMR12_PAUSE_Pos)    /*!< 0x02000000 */
#define DEBUG_CTRL_TMR12_PAUSE              DEBUG_CTRL_TMR12_PAUSE_Msk              /*!< TMR12 pause control bit */
#define DEBUG_CTRL_TMR13_PAUSE_Pos          (26U)
#define DEBUG_CTRL_TMR13_PAUSE_Msk          (0x1U << DEBUG_CTRL_TMR13_PAUSE_Pos)    /*!< 0x04000000 */
#define DEBUG_CTRL_TMR13_PAUSE              DEBUG_CTRL_TMR13_PAUSE_Msk              /*!< TMR13 pause control bit */
#define DEBUG_CTRL_TMR14_PAUSE_Pos          (27U)
#define DEBUG_CTRL_TMR14_PAUSE_Msk          (0x1U << DEBUG_CTRL_TMR14_PAUSE_Pos)    /*!< 0x08000000 */
#define DEBUG_CTRL_TMR14_PAUSE              DEBUG_CTRL_TMR14_PAUSE_Msk              /*!< TMR14 pause control bit */
#define DEBUG_CTRL_TMR9_PAUSE_Pos           (28U)
#define DEBUG_CTRL_TMR9_PAUSE_Msk           (0x1U << DEBUG_CTRL_TMR9_PAUSE_Pos)     /*!< 0x10000000 */
#define DEBUG_CTRL_TMR9_PAUSE               DEBUG_CTRL_TMR9_PAUSE_Msk               /*!< TMR9 pause control bit */
#define DEBUG_CTRL_TMR10_PAUSE_Pos          (29U)
#define DEBUG_CTRL_TMR10_PAUSE_Msk          (0x1U << DEBUG_CTRL_TMR10_PAUSE_Pos)    /*!< 0x20000000 */
#define DEBUG_CTRL_TMR10_PAUSE              DEBUG_CTRL_TMR10_PAUSE_Msk              /*!< TMR10 pause control bit */
#define DEBUG_CTRL_TMR11_PAUSE_Pos          (30U)
#define DEBUG_CTRL_TMR11_PAUSE_Msk          (0x1U << DEBUG_CTRL_TMR11_PAUSE_Pos)    /*!< 0x40000000 */
#define DEBUG_CTRL_TMR11_PAUSE              DEBUG_CTRL_TMR11_PAUSE_Msk              /*!< TMR11 pause control bit */
#define DEBUG_CTRL_I2C3_SMBUS_TIMEOUT_Pos   (31U)                                   /*!< 0x80000000 */
#define DEBUG_CTRL_I2C3_SMBUS_TIMEOUT_Msk   (0x1U << DEBUG_CTRL_I2C3_SMBUS_TIMEOUT_Pos)
#define DEBUG_CTRL_I2C3_SMBUS_TIMEOUT       DEBUG_CTRL_I2C3_SMBUS_TIMEOUT_Msk       /*!< I2C3 pause control bit */

/**
  * @}
*/

/**
  * @}
*/ 

/** @addtogroup Exported_macro
  * @{
  */

